{
    "passage":"To accept or reject electoral roll entries. RP Act new Section 23 6 allows those unable to furnish Adhere numbers for prescribed reasons to produce alternate documents. But the poor, without other documents to prove their identities and whose details may vary between their Adhere and voter card, could be hit hardest. Also, while Rijiju has said the linking is voluntary and not mandatory, amendments say electoral officers may ask for Adhere. This may may become worryingly widespread. Further, Section 23 5 suggests that Go could notify a date in the gazette by which time every person in the electoral roll may intimate his her Adhere number to authorities. The worry is what happens if a citizen dose t does this. The right to vote is a statutory right and it must t be denied to citizens without rigorous due process and just cause. EC must ensure every electoral roll entry struck off through this new process is independently verified by booth level officers on the ground. The impending big change to our electoral rolls should be foolproof and abuse proof. The holiday season around Christmas is both economically and culturally important in Europe. Yet, governments there are being forced to resort to the unpopular step of curbing mobility through lockdowns. The Netherlands has begun its fourth lockdown and media reports suggest that other governments in the continent are considering doing the same thing. It should serve as a wakeup call for state governments in India. Both Covid management data and anecdotal evidence point to laxity all around despite dangers posed by the newest coronavirus variant Omicron. India simply cannot afford even a mild lockdown because consumption hash t yet recovered from the Covid induced shock. The best protection against infection is vaccination. Here, we are lagging the initial deadline and this time states bear primary responsibility because supply INS t the issue. Go in the monsoon session of Parliament estimated that the adult population would be fully vaccinated by December 2021. At present, about 555 million, or 60%, of the adult population is fully vaccinated. The tardy pace is because vaccines are piling up with states. Currently, almost 174 million vaccines are lying unused with states. The laxity appears to be influenced by the recent trends in infection. And the Centre, for its part, is taking too long to clear boosters, at least for frontline workers and older citizens. The pace of vaccination surged between July and September and then for a fortnight after Omicron was first reported in South Africa. The same pattern shows up in testing, which is now around 1 million a day, down from about 1.5 million at the beginning of October. States need to do better. The second wave taught us that a surge can be sudden and overwhelm healthcare infrastructure. The risk of the current laxity is that it leaves governments with just a lockdown in their toolkit if infections spiral out of control. That a nuclear option for the economy. The election."
}