{
    "passage":"Disquiet and discontent among many groups tribal communities in particular are unhappy about their lot, whether it is land rights, access to education health or access to economic opportunities. So is the case with SCs, minorities and women. The Planning Commission should consider ways whereby our policies can be restructured to give a stake in economic development to the marginalized so that we can deal with the challenge. Hon. Members, This will have to be not only in commercial activities but also in physical infrastructure, where its involvement has been limited in the past. To enable this to happen, the policy and procedural environment must be made considerably more welcoming towards private investment; and, the government will have to incentivize the private sector to enter unfamiliar areas through well designed public private partnership models. The MTA document brings out possibilities that exist for such involvement and the required policy changes. At this point, I would like to raise a few issues which concern the overall approach to planning as a process. It is important that as a country, we learn to walk on two legs, one embracing processes of high growth and the other addressing the issue of redistribution and balanced development. The growth, we need to put in place a set of policies that tap into the vast reservoir of talent that exists in our country, policies that will create an environment which reward creativity and enterprise. Mr. Chairman, Let me begin by welcoming you to the second meeting of the Full Planning Commission. The Mid Term Appraisal of the Tenth Five Year Plan provides a comprehensive review of the performance of the economy as a whole and of the state of play in each of the sectors. There are several positive features which are noted but, there are also signs that the economy is not on track to achieve many of the important targets of the Plan and corrective policies are therefore urgently needed. I am looking forward to a focused discussion on the challenges ahead. It appears that even with optimistic projections about the next two years the average growth rate in the Tenth Plan period is not likely to cross the 7 mark, will below the X Plan growth target of 8.1 Employment generation is also unsatisfactory so far. The cornerstone of the X Plan had been a reversal of the declining trend in the growth rate of agriculture to eventually to take it above. The actual performance of agriculture appears to have deteriorated even further and will possibly not exceed 1.5 during the first three years of the Plan. The slippages that have been recorded in the growth rate of the economy, and especially in agriculture, have wide ranging implications for other important economic variables as well. As we all know, growth of employment and reduction in poverty are both intimately linked to growth performance, especially in agriculture. Many of these problems were recognized in the National Common Minimum Programmed and Government has already initiated."
}