{
    "passage":"Worse, it may take forever for brands to recover from the reputational damage due to a careless approach. A conflict is a sensitive issue, not a rending topic A war is not a trending topic or a golden opportunity for brands to ramp up sales or mint money. A conflict is a sensitive issue and must be treated as one. Brands should steer away from building advertising tactics around the conflict. While some brands successfully distance themselves from moment marketing, something as simple as mindless use of hash tags gets them in trouble. Brands should never use hash tags related to conflict in an attempt to increase their ad reach. While you may think that the ad in itself does touch upon the conflict, any attempt to capitalize on the situation is bound to face severe criticism. It not just about saving your brand from public backlash. It about being sensitive and sensible enough to maintain a certain level of dignity and integrity during a crisis. Political overtones could spark controversies while brands are expected to take a stand, taking political sides is not recommended. A conflict may be a result of clashes between two political parties or ideologies. A hasty moment marketing effort could end up in a poorly crafted ad that reflects your inclinations towards a certain political party. Brands may receive flak for taking sides just to appear trendy or to leverage the topicality of the war. It can spark major controversies. The worst part about moment marketing on sensitive issues is that you can never predict audience response. Something that seems totally fine to you may be interpreted in a totally different manner by the audience. Poor ad placements can hurt people sentiments Let suppose you refrained from any kind of moment marketing during the conflict. You could still risk being perceived as insensitive. Poor ad placements are to be blamed for this. Brands must be extremely careful while advertising during conflicts. You don want your ad to appear beside disturbing images of war. Wrong ad placements could easily ruin your brand image. A luxury resort ad appearing beside a war image will never be appreciated irrespective of how good the ad is. Your marketing efforts should reflect sensitivity and empathy especially during a conflict. Advertising during conflict may need extra effort and attention from brands as a seemingly minor error could blow out of proportion resulting in financial and reputational damage. Taking political stands to appear trendy or creating controversies for negative publicity and deviating from your core brand values just so you don miss out on a few extra likes or shares could lead to boycott from consumers. A conflict situation is different as people sentiments may get hurt easily and the repercussions could be more severe. While brands must refrain from leveraging war or tragedy for marketing purposes, it does mean brands should act oblivious to things happening around them. A thoughtful and empathetic approach is the way to prevent any unintended consequences."
}