{
    "passage":"The Delhi high court set aside the International Chamber of Commerce ICC arbitration award in favors of Devas Multimedia on August 29. The court found the arbitral award untenable on various grounds. This was however a forgone conclusion considering the Supreme Court had already found the underlying transaction between Antrim Corporation, the commercial arm of Sire, and Devas Multimedia to be borne from fraud. PM Mode has offered to help flood-devastated Pakistan and this is exactly what Go should do. Pakistan military-intelligence complex is up to no good, but the people of Pakistan need help. Large swathes of northern, southern and southwestern parts of Pakistan are inundated. The death toll, already over 1,100, is climbing, more than 33 million people have been affected and early estimates put the damage in excess of $10 billion. All of this has compelled the UN to issue a flash appeal for $160 million to help Pakistan cope with the disaster. Worse, the natural calamity comes at a particularly trying time for Pakistan. After the fall of the Imran Khan government earlier this year, the new Sheba Sharif dispensation is yet to find its feet. Imran has been pushing for fresh elections, and political instability is growing. Pakistan economic troubles continue to pile up with high energy prices straining its import capacity and annual inflation hitting 24.9% in July. On Monday, IMF approved a long-awaited tranche of $1.1 billion in bailout funds for Pakistan. But this will mean little when 45% of the country cotton crop a key input for Pakistan textile sector which makes up 60% of its exports has been washed away. Given this dire situation, India should seriously consider offering more than generous assistance to Pakistan. Reportedly, discussions are already underway. Pakistan finance minister has said Islamabad is considering importing vegetables from India through the land route. New Delhi should hesitate. India has sent humanitarian aid to Afghanistan overland via Pakistan this year. True, it was Pakistan that had cut off all trade ties with India to protest the 2019 nullification of Article 370 vis-à-vis Jammu & Kashmir. But all that should matter in this crisis. Sending medicines, food and temporary shelters the typical requirements of victims of natural calamities should be prioritized. A genuine and substantial help from India will also be a good strategic move. For one, Pakistan response will tell India where the Sharif government and the generals stand in terms of need-based cooperation. Second, with China BRI projects in Pakistan running into trouble and Islamabad also trying to rebalance with the US, perhaps a small space is there for India to try and re-establish some negotiations with Pakistan. First, though, let help Pakistan. With 2021 logging the highest ever count of road fatalities 1.56 lakh deaths the awful prospect of these senselessly tragic deaths repeating in greater numbers in coming years looms large. The grim number suggests governments at all levels are doing enough. Two-wheelers accounted for 44.5% of deaths, up from 35% in 2018, and pedestrian deaths."
}