{
    "passage":"With big projection screens used to be the star of the show as there was no television. Nuked Noatak, Panchayati meetings were the only medium to spread news and do mass communication with people. Sangathans and village level communities were formed to discuss problems of the people and find solutions. Attending Panchayati meets and events was the top priority of people, as this was the time when everyone could come together as a community, make decisions, air their views and share news and other relevant information. This is how large organizations like the rises came into being, by working on the idea of forming smaller units at village level and collectively organizing them under one ideology. Sangathans still hold an important place in rural India, however large-scale migration of people, particularly youth from rural to urban areas presents a complex challenge that can disrupt their functioning. In a recent interaction with a president of a popular sang than, he stated that the major challenge that their sang than today faces is the participation and involvement of youth. Technology is however coming to their rescue. Digitalisation is slowly reshaping every aspect of life in villages by introducing accessible e-governance, banking and financial services, educational and healthcare services, mobile ditch recharge etc. Additionally, those living in rural India are no longer as isolated from their urban counterparts as before, thanks to improved internet access. There is a whole generation of mobile-first rural Indians who have leapfrogged generations of technologies to the mobile phone. When it comes to communities and sangathans, the internet is providing them a new lease of life and in fact enabling them to scale much faster. The need of the hour is for them to acknowledge the winds of change and hop on to this new medium. There are several large communities that have already made the shift and seen their reach and clout grow exponentially, that too across geographies. Some examples include adivasi Jan perished, national old pension restoration united front nopruf, teachers of Bihar an initiative of got teachers in Bihar, him army brat ekta mission that have seen their user base increased multifold since they went online. This evolution is not a new process either. Since the time of the video on wheels to this day and age, the principles of sangathans are the same but it is the media formats that have evolved and they have managed to evolve and ride the change. Today, digital has joined hands with traditional and we are seeing people adapting to online mediums. Now sangathans are delivering digital experiences to the members in the local language and vernacular will be the next reality. If we look at it from the experiential growth perspective both digital & traditional are complementing each other in terms of reach and frequency of the communication. Digital can facilitate both one-to-one as well as one-to-many formats of communication. Social media for Indians serves as a melting pot of ideas of all kinds and has given."
}