{
    "passage":"Growth targets, for economic industrial complex to continually contribute to it, enhancing productivity seems to be the need of the hour. It the Ashtha eighth rishi for the Amrit Kaal. Therefore, it critical to analyse the current state and trends of the productivity of our economic complex, and accordingly develop implementable interventions. Available literature on economic development such as the Three Sector or Fisher Clark Kuznets Hypothesis suggests that production in a country shifts from agriculture to manufacturing sector first, and then to services sector. This could be an underlying reason for why India has seen lower levels of overall productivity perhaps due to the lower exposure to a highly productive industrial set up. Of course, other factors play a major role as well, especially when we consider the presence of a large number of fragmented small and micro manufacturing companies. This was largely a consequence of certain pre liberalization era Industrial Policy 1956 policies whose effects can be seen to this day. For example India toy industry wood or plastics was reserved for small scale sector; as were some textile processes like hosiery, knitting & weaving. This undoubtedly limited efficiency levels of the Indian economy as preexisting larger players, who had the capital, were able to adopt practices that improved efficiency across its verticals in order to deliver competitive products. However, owing to most new entrants being smaller players who lacked capital we saw not only a lack of ability in these companies to compete with bigger firms through improving efficiency but also posed a limited threat to large firms. As a result, a paradox emerges wherein efficiency does remain a consistent priority for larger firms who have already established themselves, while smaller firms deal with a similar prioritization, and a unique affordability challenge. Indian industries and services sectors thus require efficiency and productivity as a priority to not just improve their competitiveness in the global marketplace, and profitability, but also align their trajectories to the economic ambitions of the country. In this regard, Government can also undertake a comprehensive role in enhancing the focus for prioritizing productivity and efficiency. A systematic two pronged approach can be deployed for this, with one prong focusing on the large enterprises to enhance their awareness, incentives and responsibility towards making their enterprises more efficient and productive, and the second focusing towards MSMEs, with measures enhancing awareness and affordability for MSMEs for undertaking measures to improve efficiency and productivity. The recently announced revamped version of MSME LEAN Manufacturing scheme is a step in the right direction by the Government to enhance MSMEs affordability of external interventions for enhancing efficiency and productivity. Large scale and efficient implementation of the scheme, however, will be the key factor which results in value realization. Similarly, the Government should also adopt productivity as the Ashtha Rishi for the Amrit Kaal and strategize a manner to gauge, prioritize and support productivity enhancement measures by large enterprises in the country. The National Productivity Council in this regard can play a robust role, in commissioning knowledge periodic reports which can provide an institutional barometer to gauge efficiency across large enterprises, as well as work with industry chambers for prioritization of productivity and efficiency in corporate strategies. Learning has become an ongoing process. It does not limit to schooling or college degrees anymore. We have seen that higher education."
}