{
    "passage":"If there cross party support, these amended laws will pass. Just as Parliament replaced SC Vishaka guidelines with the Act. China ambassador to India Sun Weeding has said that the border situation is switching to normalised management and control and that bilateral ties have shown positive momentum this year. The ambassador comments contrasts with the fact that troop disengagement process in eastern Ladakh remains incomplete and Beijing continues to block UN sanctions against Pakistan-based terrorists. In fact, since March when Chinese foreign minister Wang Yi visited India, Beijing has been making subtle overtures to New Delhi. There are two possible reasons for this. First, the Chinese are now confident that they have achieved their near-term objectives along the LAC with most of the disengagement buffer zones coming up on the Indian side of the boundary and the PLA further bolstering its infrastructure on its side. The second reason relates to China feeling pressured by the US in East Asia and is therefore looking to keep India relatively neutral. This is an old Chinese tactic Beijing will talk cooperation with New Delhi whenever it is in a tight spot strategically but will revert to an aggressive posture when the pressure eases. Thus, India should stick to its position that there can be no normalisation until China drops its aggressive behavior. In fact, New Delhi should keep up the pressure by teaming up with Washington to counter Beijing growing influence among the Pacific Island nations. This is why foreign minister S Jaishankar meeting his Papua New Guinea counterpart on the sidelines of the first US-Pacific Island Country summit is important. China has been slowly peeling away the islands, with Kiribati and the Solomon Islands switching recognition from Taiwan to Beijing in recent years. In fact, Kiribati pulled out of the Pacific Island Forum earlier this year on Beijing instructions. India, which has long-standing ties with Pacific countries like Fiji, can play a part here. Hence, aside from boosting our defence infrastructure along the LAC, India should work with the US in the Pacific Islands to keep up the pressure on China. That the only way to counter Beijing. Lt-Gen Anil Chatham has been appointed as the second Chief of Defence Staff of India. A thoroughly competent professional and a good human being, he is a perfect choice for the job. The first CDS Gen Begin Rabat sadly passed away in saddle before he could finish the allotted pioneer task, that of integration of the three services and getting them future ready. So Gen Chatham has to carry forward the endeavor, in a possibly changing world order, without letting the armed forces become unbalanced at any stage. This essay is an attempt to analyses only the major challenges the new CDS faces. Navarra garb represents the womb. Will it birth a more caring country, or will it still be a miscarriage of justice? Will Dura help us vanquish our problematic Mahishasurs? All political parties are like trimetric; create chaos, preserve rotten ways, destroy."
}