{
    "passage":"Stand firm? How long do you keep ignoring a problem which keeps on spreading like a cancer? The many dilemmas it like the Aruba dilemma in Mahabharata. If not even five villages, what does Krishna do other than encouraging Aruba to wage a war? Let not be blind to the reality that illegal buildings are endemic in our system. So much so that the poor is often forced to sleep on the road under thatched roofs while the powerful usurp almost everything. Allow me to also bring to your notice that in India capital city, right under the nose of the who, the governmental agencies have failed for decades in allocating low-cost housing meant for the poorest and the most disadvantaged to the intended beneficiary. Seats meant for poor, underprivileged kids of rickshaw pullers and labourers are expropriated by private and government schools and hospitals, often in favour of those like you and me. The institutional failures are so persistent and consistent that we have stopped noticing the illegalities and become rather blind and pliant. The moment the courts would have announced the flats to be given to poor, all fixers would have come into action to play their tricks. We know how it works. Unnoticed collaterals of course, think of the people living in the buildings nearby whose homes went into darkness because of the tall, illegal building coming up right at their doorstep. Think of the many children who would have grown up with this venom inside their mind, multiplied by smaller playground and lesser green surroundings because an illegal building came up despite people like you and me. Last but not the least, think of the trustworthiness of the builder in terms of the quality of the construction. In a country where bridges are built of such poor quality that they often come crashing down on the very first day, what reason possibly we could have to believe it was a safe building. Rather, we have every reason to doubt the builder commitment to quality as he did not bother to violate every norm in the law book while erecting the twin towers. If so, how many casualties would have happened in case of a fire or a crack or a quake-induced collapse? Countering towering corruption Noida twin towers were like Ravenna golden lance ruled by a powerful, learned, wealthy and world famous Shiva devotee king who was characterless. Going back on pulling the Noida twin towers would have emboldened an entire generation of builders, officials and buyers into keeping on adding floors as the best solution to put the court and the law-abiding citizenry in Aruba dilemma. As for better choices, we had almost two decades to be sensible and enforce the law in paper and spirit the building journey started back in 2004. If we failed for 18 years, how living with a mountainous symbol of corruption for another 60-70 years could have been termed a success or a sense today, we can evidently observe."
}