{
    "passage":"Facilities anywhere in the state. The stamp duty reimbursement to Mega Large MSME projects will be 100 per cent in Purvanchal and Bundelkhand region, 75 per cent in Madhyanchal & Pashchimanchal (except Ghaziabad and Gautama Buddha Nagar district), and 50 per cent in Ghaziabad and Gautama Bodh Nagar district. Introduction of Gross Capacity Utilization Multiple (GCM) will ensure optimal utilization of installed capacity by beneficiaries of this Policy. D. For a relatively smooth and single-window experience for investors, the policy introduces the Invest UP website as a single window for everything pertaining to setting up a business in this vertical in UP. Either policy talks of encouraging OEMs to develop Ramped and testing facilities for EV/ EV batteries in the State. OTHERS A.UP has introduced CEMP (Comprehensive electric mobility plan) and will start it from Lucknow and shall extend it later to 17 cities. As part of this plan, clear targets for green mobility shall be defined for the cities and 100 per cent electrification of public transport will be ensured by 2030. B.UP has made it mandatory for government fleets to have electric vehicles. No state has given any deadline in this context, but UP leads with a target for the same. The policy also talks about monetarily encouraging state government employees to adopt EVs. Awareness is crucial to the success and pace of EV adoption. UP factors this in its EV policy and has formed a 12-member committee to run and monitor an awareness campaign. Finally If India has to achieve its climate goals, UP will essentially have to perform. While the State may not be the industrial hub of India, it still is relevant on the basis of the population it is home to. Almost one-sixth of India calls UP its home. So, with a population of such proportions, the State also demands and consumes resources proportionately. This also translates to an equally dense and complex transportation system. It may be noted that India transport sector contributes almost 10 per cent to the total national greenhouse gas (GHG) emissions. Of this, almost 90 per cent comes from road transport. Under such circumstances, the promotion of electric mobility can result in a significant drop in tailpipe emissions volume. In this context, UP efforts to tackle air pollution by promoting electric mobility and in the process, also boosting the local economy, is clearly a win-win situation. Fundamentally one which cannot be measured cannot be managed. The biggest dilemma is when the rest of the world could not convince Russia and Ukraine not to engage in a war, how effective is it going to be for COP to convince the world that actions are needed on the ground to save mother earth? Environmentalists, innovators, corporate, and common masses, carried myriad expectations from the conference of parties (COP) 27. It looked like the most revered global climate conference, in Sharma El Sheikh, Egypt (from November 06 to18). It provided no less than a golden opportunity for stakeholders, countries, corporates, climate advocates."
}