{
    "passage":"Considering all the positive achievement of the University and the constraint of funds facing the University, I have agreed to upgrade Manipur University as a Central University. Furthermore, the College of Technology would become a constituent college of the University. The Ministry of Human Resource Development, Government of India would be issuing the necessary orders in this connection very soon. I want facilities improved here so that you do not have to travel to distant cities in search of quality education. But, for those of you who chose to go to New Delhi or other important Centers of Education, we will try and see how we can provide some assured hostel facilities from the North Eastern States so that you are able to find a home away from home. We live in an increasingly knowledge based economy and education in the most important empowerment we can secure in building the capabilities we need to face the world outside. You young men and women have had the benefit of good education. I urge you to put it to the best use possible, in the interest of your families, your communities, and your nation and of mankind. I am nation building. I urge you to appreciate the fact that education is but a medium for the flowering of the human personality. It is a reservoir from which spring the streams of innovation and imagination, of bold new departures, of dynamism in thought and action. I invite you to write. Hon. Members, I am delighted to be here back amidst all of you, my own people in my adopted home. Returning to Assam has been a memorable experience this time. I was of course here a few months back but that was to join you in hour of distress. People are coming from the rural areas and all castes and communities are represented. The conditions under which the all trainees stay are military conditions. Free ration and uniforms are given. Some Hon. Members have visited these caps. Another important aspect of the training is that those who are illiterate, effort is no to make them good citizens. Our aim of training to them is to create a sense of leaderships every trainee. As a result of this, people are anxious to help themselves. There is a deserve build roads and dams and to spread education and a sense of discipline in the village training will be useful in peace time as well as in times of emergency. AILSA is dedicated to the promotion and welfare of law students all over India. It strives to establish a platform for interaction with similar organizations at an international level for the benefit of student community. AILSA provides law students with opportunities to interact with legal professionals in both national and international arena. On regular basis the association conducts academic conferences, seminars, free legal aid, and academic conventions. Through the association, student activists and law professionals are constantly working together to fulfill the national demand for legal support."
}