{
    "passage":"Transactions, eliminating the costs of settling deals involving different currencies. The dollar unique status and primacy rests on the perception of America being a stable, reliable bedrock of global politics and business. What happens if American politics gets uglier and the US slides into a civil war and its economy goes belly-up, as many Cassandra are suggesting it could? Obviously, the world would have to transition to a new currency if global trading chaos that could ensue if it began transacting in multiple currencies is to be averted. The natural dollar replacement candidate would be the Chinese Yuan, currency of the world second largest economy, on track to be the largest. The last time the world transitioned its reserve currency from the British pound to the American dollar some 80 years ago, the transition was relatively seamless because the US and UK were allies. That is not the case with the US and China. There is not an iota of chance that Washington will cede the primacy of the dollar to the Yuan. But to fend off the challenge from the Yuan, the US will have to continue to project the image of a strong, stable, open, transparent nation governed by rule of law commitments that have underpinned the primacy of the US dollar. So there is so much beyond abortion, guns, and immigration at stake in the upcoming US mid-term election and acceptance of the legitimacy of its results. Not just health of American democracy, even global financial stability is at play. At least 134 people have been reported dead in the bridge collapse in Morbid, Gujarat. When the century-old suspension bridge broke apart yesterday evening, it was loaded well beyond capacity. The Chat Puja crowds along the way delayed the rescue teams and then their operations were made difficult by the thick algae covering the Matchup river underneath the bridge. The critical question is whether this was an avertable tragedy. If so, the multiple layers of negligence that contributed to it should be transparently laid out in front of the public. As last week deadly Halloween stampede in Taejon, Seoul also underlined, overcrowding tips over into tragedy because authorities are lax in its initial stages. Beyond the tipping point, fatalities just mount. But unless accountability for such laxity is fixed and punishment meted out, lives will continue to be lost. India is a densely populated country and the Indian calendar is packed with celebrations. Many are well run: Kombi meal springs to mind. But when those that are not turn into disasters, nobody is punished. Who has been punished for the New Year stampede at the Vaishno Devi shrine? In the Morbid case, additional layers of mismanagement are suspected. After being closed for renovation for several months, the bridge was reopened for the Gujarati new year on October 26. Was this reopening rushed for poll reasons? Did the private contractor in charge of maintaining the bridge reopen it without a fitness certificate from the municipality? Such questions need."
}