{
    "passage":"Should avoid unnecessary touching of eyes, but if you feel to itch then do it with clean hands. Stretching specific tendon or muscle can improve the elasticity of muscles, which in turn helps in achieving a comfortable muscle tone. There are several benefits of regular stretching, and it should be an integral part of every workout program. It not only helps increase your flexibility, which is an important part of fitness, but it can also improve your posture, body aches, reduce stress, and much more. One of the benefits of regular stretching is that it enhances flexibility. Being flexible has its own advantages, as it not only improves your day to day activities, but can also help delay the reduced mobility that comes with aging. Stretching a regular basis can help increase your range of motion. You can either go for static or dynamic stretching as they both are effective when it comes to the increasing range of motion. According to the studies, proprioceptive neuromuscular facilitation or PNF type of stretching is more effective for immediate results. Regular stretching can not only help heal an existing back injury but can also prevent future back pain by reducing your risk for muscle strain and strengthening your back muscles. All the people who regularly go to the gym know how helpful stretching can be. Performing dynamic stretches prior to exercise in the gym can help prepare your muscles. Not the only gym, but it can also help you improve your performance in dance or an athletic event. It is only natural that your muscles get tense when you experience physical or emotional stress. This is because the tightening of your muscles is the response of the body towards stress. All you need to do is focus on the areas of your body where you feel the stress, such as your neck, shoulders, etc. and stretch those parts of your body. Many germs and bacteria precious live on hands that can come in contact with your eyes, causing eye infections such as bacterial conjunctivitis or pink eye. Rubbing of eyes is one of the ways how people precious catch cold virus gears. Taking a good night sleep has several benefits such as it thrives and makes our immune system stronger. You will feel the difference when you precious get a good night Iodine fortification is what most countries rely on to encourage adequate dietary intake. A good length in today cricket is a thing of uncertainty. Not to batsmen as it used to be, but to the bowlers. It can turn a bowler into a menace or a novice because batsmen practicing range hitting find it easy to line up length balls. There are few as good at it as those from the Caribbean. But, with a little bit of nip or some extra bounce from the surface, this batsmen bowler dynamic can revert to the traditional. All it requires is a little patch of grass in the right position, or sometimes even."
}