{
    "passage":"Jails. Such lock ups are more dangerous than the ones created by the state. Let us look out for these. Freeing ourselves from them through introspection and self awareness will be in one own interest and society. The desire and action to contribute to making this universe more harmonious is the ultimate music of life. External threats such as weather or terrain which are outside a pilot control can cause an aircraft accident. But pilot actions or decisions are often the deciding factor in such accidents. So, the accident is often a pilot error accident. One type of pilot error accident is controlled flight into terrain CFIT. The Mi 17 crash in Nilgiris hills that killed General Bipin Rawat and twelve others was a CFIT. It was not the first CFIT. Nor will it be the last. Prime Minister Morarji Desai Tu 124K crash at Jorhat is the most noted CFIT of India. That crash 44 years ago happened from a pilot induced situation. All five aircrew in the cockpit died. But except for PK Thungon chief minister of Arunachal Pradesh who broke a leg, the Prime Minister and all others aboard escaped with minor injuries. Most CFIT accidents occur in the approach and landing phase of flight. Pilot error is the most common cause of CFIT. Such error happens because of pilot loss of situational awareness that is his failure to know aircraft actual position in relation to the ground below and to the ground ahead on the course he is flying. A few of the precursors of CFIT are: low clouds, poor visibility, altimeter setting error, and low on fuel. Prime Minister Desai Tu 124K took off from Palma for Jorhat at 0515 pm on 04 November 1977. It attempted to land at Jorhat at about 0730 pm, that is about three hours after sunset at 04:29 pm. The night was moon less and dark. For night landing, Jorhat had a flare path marked with World War 2 vintage gooseneck flares. Gooseneck is a wick in kerosene which is lit up. Pilot had to judge his approach path and height above ground from the perspective of the flare path and from the altimeter. To judge the approach path from the perspective of a flare path is difficult. In 1961, renowned composer Anil Biwa son Prided, an IAF cadet, was killed in a CFIT. On a cloudless, visibility unlimited night, flying a Dakota, judging his approach path from the flare path at Begum pet airfield, he crashed into terrain. Tu 124K pilots mostly used Instrument landing system ILS for approach and landing during day and during night. They had little practice in judging approach path from the perspective of flare path alone. The only navigation aids Jorhat had was a Medium Frequency Non Directional Beacon NDB, and a Very High Frequency Direction Finder VHF D F. The only thing these could do was to show the pilot the direction of the airfield from the aircraft position. And thus help."
}