{
    "passage":"Happy indeed is the person who has inculcated the habit of reading. Such a person is never lonely or sad, for he always has books as his faithful companions to give him solace when he has been deserted by everyone else. The person who reads has secured for himself a lifelong source of pleasure, strength and inspiration. Whenever he is bored or depressed, he can pick up a book and lose himself in the vast world contained therein. Books contain a wealth of knowledge and information. There is no aspect of life which is not covered by books. Over the ages, great writers, thinkers and experts have written down their thoughts and ideas and preserved for posterity, through the printed word, noble precepts which we would do well to emulate. Books are like coffers filled, not with gold or silver, but with high ideals, and the wisdom of our forefathers. If we learn to love books, we need no other riches. However, we must read the right kind of books. Just as we need nourishing food for the body, similarly we need to read good books to enrich our minds. There would be a balance between light reading and serious reading. While light reading like fiction relaxes the mind, serious reading provides it food for thought. Friends may leave us, loved ones may go away, but books are always there to stay. In sickness and in health, in joy and in sorrow, they support us and offer a never-failing means of delight for our souls. Reading is of different kind. It may be light or serious. It may be adventurous or spiritual. Every reading has its distinct pleasure. Some people like to read newspapers, periodicals, journals etc. They are storehouse of general information about current events and various socio-political and economic problems. It has been well said, Books are like axe-they cut through the snow within. Happy indeed is the person who has inculcated the habit of reading. Such a person is never lonely or sad, for he always has books as his faithful companions to give him solace when he has been deserted by everyone else. The person who reads has secured for himself a lifelong source of pleasure, strength and inspiration. Whenever he is bored or depressed, he can pick up a book and lose himself in the vast world contained therein. Books contain a wealth of knowledge and information. There is no aspect of life which is not covered by books. Over the ages, great writers, thinkers and experts have written down their thoughts and ideas and preserved for posterity, through the printed word, noble precepts which we would do well to emulate. Books are like coffers filled, not with gold or silver, but with high ideals, and the wisdom of our forefathers. If we learn to love books, we need no other riches. However, we must read the right kind of books. Just as we need nourishing food for the body, similarly we need to to."
}