{
    "passage":"Is to be done by authorities like Food and Drug Administration. Lastly, a patent is acquired by the organization for this approved drug. To recover the cost of research and development, companies usually price their brand name drugs on the higher side. This drug enters into the market including all costs born by the parent company for all the stages, which in turn makes the branded medicines costly for the end users. Now after a fixed period the patent of a drug expires and thereafter manufacturers can mimic the drug and make their own version. Now manufacturers do not go through the mundane process of clinical trials to prove the efficacy of the drug. Due to this, generic drugs cost less as compared to branded medicines. The generic medicines have the same molecular structure in comparison to the branded medicines, which means there is no compromise in the quality of ingredients. The active ingredient of the generic drug is the same as that of the branded drug, however, the inert ingredients, which give the drug its color, shape, or taste, vary from the brand name drug to the generic drug. As per the rough estimates, a generic medicine costs at least 50% cheaper than the same medicine with a brand name. Pradhan Mantri Bhartiya Janaushadhi Pariyojana PMBJP stores have been set up to provide generic drugs. It also reduces the out of pocket expenditure on medicines and thereby redefines the unit cost of treatment per person. Perhaps this can be a game changer for the health sector of our country. Artificial Intelligence AI and Machine Learning ML are certainly the most revolutionizing industrial technologies we know today. More business organizations are leveraging AI every year, enhancing their products and bringing more competitive and insight backed advantages to their strategies. So, it is certain that AI can overhaul any fragmented business perhaps in the storage space too The way AI innovations are accelerating, one should soon be able to witness expansions from Edge to enterprise infrastructures in a simple and cost effective manner. The only major hindrance in this progression is storage and deployment challenges. But the question arises could AI by itself address these challenges? AI for Smart Storage? In our modern world, AI is powered by data, but the only problem being data is either stored or managed in a way that makes it difficult and costly to access, maintain or expand. For mitigating this, enterprises must evaluate the value and purpose of this data, eliminate the unwanted fragments, and streamline the valuable data with compliance checks, data governance, and cataloging. This is where AI enabled storage steps in, providing real time updates from several data sources in an optimized manner and automating workflows while minimizing human interventions. According to recent market study, AI powered storage market is set to be worth around 25 Billion by the end of 2025, reflecting at 17.56% CAGR over the period. Now, the real question that arises is what are the advantages of."
}