{
    "passage":"That deep cost reductions in clean technology and India renewable and lithium edge can enable a pathway for cost effective energy independence. The country focus on renewable energy sources and commitment to investing in new technologies is commendable, and it is hoped that India will achieve its vision of a sustainable and energy independent future. Electrical distribution needs are continuously evolving in residential, commercial, and industrial sectors. Owning to this, the demand for electrical power is on the rise, indicating the probability of electrical fires exist and take many lives, damaging significant amount of property. Even a minor electrical fault can have serious consequences. It is imperative to consider that the electrical installation in every building must be protected against fires caused by electricity. Electrical fire can be a silent killer occurring in areas of the home that is hidden from the view and early detection. Due to lack of awareness, often investing in safe and robust electric circuit protection devices, takes a backseat. At 230 V and 2.5 A it only takes 1 second for a damaged electrical insulation to catch fire. Arc faults damaging of a wire cord can create a hot spot which results in carbon deposits with increasing temperature. With time this can eventually lead to fire by subsequent arc faults. The risk of electrocution and electrical related disaster can be minimized by proper knowledge sharing and installation of AFDD in buildings. AFDD provides protection against such faults. The objective of the device is to protect the building electrical circuits in a manner that will reduce the risk of it being a source of an electrical fire. So, in order to successfully detect series and parallel arc faults we need an Arc fault detection device. Choosing AFFDs is essential Arc fault is hazardous unintentional arc between two conductors. Such effect in the conductor may cause inflammation of insulation and subsequent setting of a building on fire. The causes of arc faults include, trapped crushed cables, rodent damage, pierced insulation, deteriorating insulation by environment, damaged insulation, loose terminations. The primary circuit breakers like MCB, RCBB and the fuse do not switch off, because they are not able to sense and react to such fault. An arc has certain characteristics which differentiates it and makes it identifiable. Unlike a circuit breaker which detects overloads and short circuits, RCDs residual current devices can detect current imbalance and leakage current only, but an AFDD utilises electronic technology to analyse the signature waveform of an arc to differentiate between normal arcing and arcing faults. This includes high frequency noise within fault current, and breakdown at the zero crossing of the fault current. RCDs are efficient to reduce the risk of fire by detection of leakage current and arcing to ground as a consequence of tracking currents within an electrical installation. But RCDs are not able to reduce the risk of electrical fire due to series or parallel arcing between live conductors. AFDD analyses various electrical parameters to ensure that it trips."
}