{
    "passage":"Udgir respectively could rightly be described as State Sponsored Literary events. Both the shows were organised on the basis of support expended by two Ministers. Most NCP leaders and their associates dominated these literary meets. No wonder, an otherwise important cultural event in the literary circles, took the shape of a congregation where everybody relished assailing Modi and appreciating State Govt. Never in the past Sahitya Sammelan was allowed to be hijacked by politicians to be precise that of the NCP, in such a seamless manner. In a scenario like this, Maharashtra faces a serious meltdown. Situation can be saved only if all the three ruling parties rise above their own partisan interests. For an alliance where partisan interests is the only glue to make them stick together, rising above them remains a distant dream, sadly. Electric vehicles are going to be the future of mobility. Concerns about the environment and climate are motivating more buyers, especially younger ones, to choose electric vehicles over those run by fossil fuels. Vehicles run using traditional fuels will not completely phase out, at least not in the foreseeable future, but electric vehicles will gain a greater market share. From 1.4 billion in 2021, the Indian electric vehicle market is expected to exceed 15 billion by 2027, projecting annual growth of 47. Automobile manufacturers and policymakers are naturally gung ho about the future of electric vehicles and the electric vehicle revolution, but the immediate and bigger challenge for India is to build a safe and sound electric vehicle ecosystem, in which the component supply chain will be a key. In fact, as I write this, safety concerns are the most pressing challenge before electric vehicles, especially two wheelers. In recent months, there has been a spate of incidents of electric scooters catching fire, giving rise to serious question marks over their safety. There have been reports that many buyers have cancelled their plans to buy electric vehicles because of the incidents of fire. This may be an overreaction and a temporary one, but it stresses the importance of safety in the electric vehicle ecosystem. The projected growth In demand for electric vehicles presents an immense opportunity for vehicle manufacturers as well as Original Equipment Manufacturers OEM. Already, we have seen a number of manufacturers line up aggressive model launches in an attempt to gain the early mover advantage. While higher cost is the key reason for the low penetration of electric vehicles in India, the lack of a charging ecosystem is another. Many people want to buy an electric vehicle but are concerned about the absence of charging infrastructure. The government is pushing for setting up electric vehicle charging kiosks across the country to bridge the gap. Many large corporates, including several public sector units, are also investing in the electric vehicle charging ecosystem. Another key challenge before the electric vehicle industry is the absence of a component manufacturing ecosystem or supply chain, which forms the backbone of any industry. There are no supply."
}