{
    "passage":"Same time, there will be cost saving from their no displacement from native places. Ostensibly, given no overhead expenditure on students, repeatability in the usage of learning content, a lesser requirement of course instructors, the institutions will be spending less on online education. Consequently, the cost of digital education must be significantly lesser than campus based regular education. Therefore, the conceptualization and execution of formal online education and freshly ideated digital University in the country must take care of genuine concerns on the standard of education, integrity of processes, ease of reaching out to the target audience, and minimal cost of education. Approbating virtualization of higher education is a double edged sword and embedded with conflict between managing quantity and quality. There is a candidate from a political party who cannot by law be named in the media yet she has been widely identified in the news. An Unna poll candidate, who will face voters on February 23, in the fourth phase of UP polls, is the mother of a victim of sexual assault whose father was killed in police custody allegedly by her attacker, a BJP MLA, goons. As things stand, according to Section 228A(2) of the Indian Penal Code, no victim of any sexual crime, or any person associated with the victim, can be identified in any fore. Breaking the law can attract two years in prison apart from a fine. The sensitivity and strictness with which the Supreme Court views not only naming of victims but also any reference that could identify the victim, was reiterated by a Supreme Court bench of Justices Madam B Looker and Deepak Gupta in their judgment in a sexual assault case in 2018. The judgment said, No person can print or publish in print, electronic, social media, etc. the name of the victim or even in a remote manner disclose any facts which can lead to the victim being identified and which should make her identity known to the public at large. The justices reasoned that Nirbhaya became a symbol of protest without her name being in the public arena. A blanket ban is well intentioned, and in many cases must be upheld in full, but it is necessary to note that of late many women have chosen to not keep their identities under wraps over fears of harassment and discrimination. Among the first who spoke up was the victim survivor in Kolkata Park street case. Assaulted in 2012, she revealed her identity in 2013 as she marched to protest crimes against women. In the latest instance, a Kerala actor has revealed her identity after pursuing justice for four years, where she has accused a popular Malayalam actor of hiring goons to sexually assault her and record the crime. In recent years, notwithstanding the emotional and cathartic outrage and changes in law that followed the Nirbhaya case of 2012, gruesome crimes of multiple men assaulting a woman Badaun, Hyderabad, Hathras, Unnao to name a few have continued. Convictions remain low NCRB."
}