{
    "passage":"One way to curb this socio economic problem is to mandate corporate insurance coverage for diabetes. There are various benefits to this approach: It alleviates the economic burden from the workforce: A study published in 2007 suggests that an estimated USD 2.2 billion would be needed to sufficiently treat all cases of type 2 diabetes in India. Another study suggests that by 2025, most people with diabetes in developing countries will be in the 45 to 64 year age group, thus threatening the economic productivity of the country and the income earning ability of individuals. Mandating corporate insurance coverage for diabetes can help cover the cost, go for timely checkups, and take preventive measures to avert complications. Enables better productivity and ensures timely treatment: In the urban working class section, medical expenses and hospitalisation have always been a concern. A zone wise study published in for the south zone, for the north east and the west zone. If the employer gives this cost exemption, it becomes a huge relief for the employees to do timely tests and lessen the number of absenteeism due to complications of diabetes. A 2007 ICRIER survey showed that almost a quarter of the companies lose approximately 14% of their annual working days more than 51 days in a year due to sickness, and one can expect an equal percentage of loss in their productivity and profits. If we take the case of diabetes, an estimation of the loss to an organisation on account of absenteeism, loss of productivity of peers, subordinates, and managers due to a condition like diabetes is boosts employee wellness and leads to a happy work culture too: Including corporate insurance for diabetes would also help boost employees morale, a company that cares, thrives better with their workforce ready to push the limits. Furthermore, if a financial burden of diabetes treatment and care can be lifted it can also lead to a happy work culture. In our initial data from Fitter fly, we have found that some of these changes and benefits extend beyond the employee to the whole family. A better plan with better to individual to find an insurance policy that can suit their needs, with a diagnosis like diabetes might be difficult, but if big corporates take a step to secure employees living with diabetes, insurance companies can roll out policies that cover comorbidities or give better benefits than an individual plan, though it looks like a far cry at the moment, but could turn into possibility with corporations stepping up to mandate diabetes insurance cover. Apart from incorporating insurance for diabetes in corporate plans, organisations can also focus on preventive health care schemes to curb the problems of lifestyle diseases before it is too late. Incorporating Detox programs is one way to do that. In addition, helping employees live a better life by driving behavioral changes that are the core of Detox programs can also help save on corporate funds and improve the collective productivity of the workforce."
}