{
    "passage":"Be peace in me. Om Peace Peace. Peace implies order. Departure from order is a disturbance. Since nothing is fully in order, we cannot get rid of disturbances altogether. In that case, the degree of disturbance plays an important role. The more the disturbance, the less peaceful we are. We have a dual nature: static and dynamic, both acting at the same time. At a given instant, the body may be static, but the mind is dynamic. In the language of science, we can say that the mind is itinerant, while the body is localised. The Bhagwad Gita says, and we also know, it is difficult to make the mind localised. If we can control the mind, then we can regulate peace in ourselves. If we are peaceful, then we can influence the state of peacefulness around us. If we are powerful or influential, the range of our control is widespread. The Bhagwad Gita again has a prescription as to how we can be peaceful. Knowledge and self control can lead us to a peaceful mind. When we have an abundance of peace in ourselves, it automatically diffuses to the surroundings. Diffusion is a natural process. It flows from abundance to scarcity. However, it is not a free flow. It can encounter disturbing barriers. If disturbances are minimised, then diffusion is smooth. Self control is the biggest challenge for anybody. The biggest impediments in the process of self control are desire, greed and anger. The Gita prescribes two kinds of human nature divine and demoniac. The degree of self control is more in divine people. A divine person is insensitive to the dualities of nature. His reactions are cautious and prudent to the changes. However, demoniac people can be deceitful and egoistic. These people are not at peace, therefore, no positivity comes from them. However, there are instances of transformation, and even complete transformation. It can happen in a positive environment. It is not strange, therefore, to see a bright speck and streak of light in a dark cloud. There is a scientific reason, too. Clouds have water molecules. These molecules interact among themselves and, as a result, there is molecular excitation. This process is not unilateral. The de excitation that follows emits light. From this we can draw a parallel in life. Intense arguments, although appear to be irritating sometimes, ultimately pave the way for new knowledge and innovations. War destroys peace. It sometimes makes us feel helpless. It appears as if some sort of destiny controls everything. Perhaps destiny is written by some kind of ultimate reality. Therefore, the aforesaid invocation says, Let there be peace in the ultimate reality, too. There is a need for urgent action towards climate change as it poses detrimental global development challenges. The governments across the globe are making climate change commitments like achieving Nationally Determined Contributions NDCs as part of the Paris Agreement. They are also taking measures to push green growth by adopting targeted policies and incentives. At the same."
}