{
    "passage":"Delhi and the nation paid the heavy price of this. The people of Kashmir Valley thought they would get Independence or form part of Pakistan, so 26 Jan 1990 was declared by the terrorist organisations to be the day of Independence of Kashmir. The Kashmir Valley was struck with violence, bloodshed and brutality. Even people were asked to surrender their passports. Within a few years, not less than 350,000 members of the Hindu minority had to leave their homes & hearths they are now leading a miserable life in the camps at Jammu, Delhi, Chandigarh, Amritsar and other places. Today, Islamist radicalisation in Kashmir is a significant threat. And there is no doubt that this radicalisation has taken place due to the consistent efforts of Pakistan. Kashmir had been a liberal society for ages, but radicalisation has affected it. Today Kashmir presents a different picture. The generation born after the 1990s knows nothing about the Kashmiryat, as they grew up in an environment of terrorist violence and the presence of security forces. There is strong resistance to the resettlement of Kashmiri Pandits in the Kashmir Valley. The majority of youth talk of the Caliphate and Islam as their ultimate goal. The process of Islamic radicalisation has been parallel with the occurrence of political and social events in the J&K. Therefore, it is imperative to take measures to counter radicalisation in Kashmir Valley to thwart the propaganda of Pakistan. In any policy making initiative, the policymakers must consider that Islamic radicalisation in Kashmir has a specific age component of 14 30 years. Youth must be given space in political, social and cultural domains. The youth perception of belongingness and empowerment needs a complete transformation. There should be more channels of hope and opportunities. At the same time, there should be stringent measures to desist youth from joining terrorist organisations. And the message should be thunderous and precise that for dialogue within the framework of the Indian Constitution, the sky is the limit. Still, if you move to the sphere of violence and extremism, then they should be ready to face the music. Radicalisation is nothing but a distortion of facts and misinterpretation of religious texts. Hence the counternarrative must emerge from the Muslim community, mainly from local Kashmiris. It is a difficult task, but the solution lies there only. Further, there is a need to promote Sufism to counter Salafism. People must be encouraged to celebrate life concerning scientific aspects rather than dogmas in the long run. Although social media has infiltrated our daily lives and become a powerful tool, it is not always used for a good cause. Terrorists use social media for radicalisation, recruitment, funding, planning and execution of terror activities. Extremists have developed an extensive presence on the Internet through messaging platforms and online images, videos, and publications. These activities facilitate the groups ability to radicalise and recruit individuals who are receptive to extremist messaging and ideologies. The counter radicalisation machinery needs to evolve according to the Internet."
}