{
    "passage":"The 50th year of diplomatic relations between the two countries and spell out an action plan for further cooperation between the citizen representatives of the two countries. Mr Hue action plan comprised three aspects. First, he desired deepening of relationship between the two law making bodies keeping in view the Comprehensive Strategic Partnership. This was aimed at better understanding of the regional and international issues among the law makers of the two countries an essential ingredient for overall cooperation between the two countries. Second was the need for two sides to better understand about policies on socio economic development and foreign affairs of each country. Third, to have a system of comparing their notes on international and global issues of common concern and to seek solutions to global challenges for contributing to peace, security, stability and development in the region and the world. The visit of Shri Om Birla along with the Delegation was an important step to push the progress on above aspects. Vietnam is critical for India Act East Policy initiated since 2014. The two countries are jointly implementing the 2021 2023 Action Program, which aims at developing bilateral ties further and more productively. Shri Om Birla pointed out in Vietnam that India established the Friendship Parliamentary Group with the National Assembly of Vietnam with the objective of enhancing cooperation between the Indian Parliament and Vietnam National Assembly. On 21st April, he addressed a community event organized by the Indian Embassy in Vietnam with Indian Business Chamber of Vietnam in Ho Chi Minh City. In his meeting with the Secretary General of the Communist Party of Vietnam Mr. Nguyen Phu Trong, Shri Birla emphasised that Vietnam remains one of India closest partners and an important pillar of the country Act East policy and Indo Pacific vision. The Lok Sabha Speaker also stressed that India and Vietnam share a common outlook on issues of global and regional peace. Speaking about matters of regional and global importance, he remarked that as the two countries were facing similar challenges and sharing similar developmental perspectives, India and Vietnam could further expand their cooperation in areas such as climate change and sustainable development, health care, and the digital economy. Underlining the two countries shared vision in the defence sector, the Lok Sabha Speaker observed that the Indo Vietnam defence partnership was growing rapidly in areas like defence industry, maritime security, capacity building programs, and UN Peacekeeping. He added that the defence ties were a major contributor to the peace, security, and stability of the Indo Pacific region. He urged the Vietnamese leader to make efforts to further strengthen this strategic partnership. India is providing assistance to Vietnam for enhancing its defence capabilities. While acquisition of the BraMos missiles by Vietnam is being discussed, its finalisation is being awaited. This would go a long way to further strengthen defence capabilities of Vietnam. There was a focused deliberation on the need for stepping up bilateral trade. Shri Birla desired that the bilateral trade between both."
}