{
    "passage":"Meaning benign Shankar beneficent; Mahesh war great Lord; and Mahdi great God. Shiv is represented in a variety of forms: as the cosmic dancer Natural; as a naked ascetic; a mendicant beggar; Ad yogi; and as Ardhanareshwar an androgynous union of half male and half female. Shakti paired with Him is the embodiment of power and manifestations of Uma, Sati, Pārbati, Dura and Kali. According to Kashmir Slavism, Paramshiv is Parabrahmn, the ultimate reality, the one form where from everything emerges. Paramshiv manifests himself by a process of descent, from Paramshiv to java, through 36 tetras. The vibrant creative energy of Paramshiv known as panda moves him to manifest these 36 tetras as Lila, divine play, on Shivaratri. Shiv Shakti consciousness and awareness of light are venerated and worshipped on this day. Their dimensions, the five pure tetras of universal experience, are: the initial, creative, motionless Absolute; the energy, Bind ta-ta, that polarizes consciousness I and his, subject and object; the Sadakhya tetra that is responsible for the appearance of a ham, self; the Ishtar tetra in which you realize, his universe is my own expansion; and the fifth, Sadvidya when uprush actually realises his own nature, and yet this realisation is in motion. Sometimes you realize it, sometimes you forget it. Seven pure impure tetras act as instruments that assist the soul in liberation. These are uprush and Maya tetras, the five kanchukas, cloaks that block the subject from recognising the divine nature of the Universe: time, knowledge, desire, causality and being limited. Twenty four impure tetras are: uprush and priority tetra; sativa tames and rajas tetras; five senses organs; five karmendriya, motor organs; five sensations; and five physical elements. The Buddha is the first to emerge from priority. It descends into ahamkara. The external sense of self is then experienced through the manes, sensory mind, which evolves to the lowest tetra. On the auspicious night of Shivaratri, a new cycle of creation begins. The two sources of light, Shiv and Shakti, merge to give rise to universal consciousness through the 36 tetras. The universe is just a proliferation, pervaded at every plane by Shakti, the divine presence. Shiv is supreme, non evolving, undifferentiated and manifests Absolute. Both the manifest Absolute and manifest Absolute are His creative powers and, therefore, inseparable. According to quantum physics, there is no matter, it is only panda, vibrations or wave formations in the ocean of consciousness. The universe is a vibration of waves. The cyclic movement of internalisation and externalisation occurs within consciousness at the most elevated plane in creation the Shiv Shakti tetras. The visible world that emerges from panda, subtle vibrations, is the throb of the divine. All souls are one with Paramshiv, the Absolute Consciousness, something that is forgotten due to Maya or ignorance. However, through knowledge, we can recognise our divine nature and become liberated. And Shivaratri is the occasion to aspire for this. As Covid 19 catches a breath and economy opens up, the retail sector is standing."
}