{
    "passage":"Under the Startup India initiative. In conclusion, India startup ecosystem is thriving, driven by a large market potential, fast growing economy, government support, and a diverse and innovative startup culture. The success of Indian startups has attracted the attention of international investors who see immense potential in the country startup ecosystem. With continued support from the government and private investors, India startup ecosystem is poised for significant growth and innovation in the coming years, especially in the healthcare and education sectors, which the pandemic has highlighted. Have you ever wondered how quickly sun sets? For the whole day, it was right out there. And now, I looked away just for a moment and it was gone… Leaving the dull looking sky behind. The sky at this moment, looks just like my face when I see it in the mirror these days. It looks faded. People in our life are no different. They come and acts to be permanent and then leave. Sometimes without even bidding a proper goodbye. But then, how would it have changed anything if they had announced it in advance. Nothing in this world can prepare you to witness the departure of your loved ones. Every morning when I wake up, I don want to open my eyes knowing, you would be a part of this new day anymore. Every evening when I am alone at terrace, I walk. I walk a lot. And I walk so fast that I won have to struggle falling asleep when I go to bed at night. Brisk walking is the only thing that keeps me sane these days. All day and night, I see your memories dancing In front of me. So I walk. I all keep walking. Till the time I leave your memories far behind so that they all never come back to haunt me again. Sometimes I feel okay too. This morning when I cooked breakfast at home, you were in my mind at that also. But I was missing you that much. And it felt good. In that moment, I felt I could survive. But then how long can I use these new hobbies as an escape from your thoughts? In the evening when I was on terrace, I saw few boys, there. I had never seen them before. It was hard to ignore them or to stay there while they were there too. I walked toward them. I wanted to ask what they were doing but then backed away. If I could lose a place in your heart that was once mine, how would keeping a terrace to myself make me any better? My heart ached. Ye Bhi le lo. I am mostly fine around people but the moment I am left alone, I sit and cry. And now it happens naturally, like that lady who knits sweater anytime she alone and has nothing else to do. The only difference is that she can estimate the time it will take to complete her sweater but I can. Customers today have a heightened awareness of the importance of quality sleep and the role of the right mattress in achieving it. The middle aged demographic, in particular, is increasingly health conscious, leading to a surge in demand for orthopedic mattresses. Unlike in the past, customers now conduct thorough research online before deciding on a purchase, comparing prices and reviews. While a mattress is typically replaced every seven years, many customers return to purchase pillows and accessories within a year and a half. However, the industry faces several challenges, including a lack of standardization. While the West has only five standard sizes, India has 18, and mattress thickness also lacks uniformity. Local players can easily fulfill customized size orders, giving them an edge over organized players. Furthermore, materials lack standardization, leading to low quality products entering the market. Even large players resort to using subpar materials like expanded polyethylene EPE, leading to a lack of quality."
}