{
    "passage":"The people who are quitting their jobs are joining at places that provide them greater flexibility. Today, more and more people both employees and employers are going for permanently remote or hybrid work models as this cuts operational costs for the company and transportation expenses for its workers. Besides, people are taking up a job for money anymore but are also evaluating the values that the company stands for. In view of this, businesses are leveraging artificial intelligence AI to find the right person for the job even if they are hiring someone just for a specific duration. Besides finding the right fit, the use of tech in the recruitment process is also helping companies weed out any possible human bias. HR Tech & DEI Technology plays a pivotal role in achieving the diversity, equity, and inclusion DEI work goals. As a concept, it means employees should not encounter any inequality due to their race and ethnicity, sexual orientation, socioeconomic status, gender identity, religion, language, age, marital status, veteran status, mental ability, physical ability, and disabilities among others. In addition, the DEI goals also advocate embracing differences and promoting justice, fairness, and impartiality at the workplace. To ensure these values, the adoption of Artificial Intelligence AI by a business has become more crucial than ever. Technology provides data driven insights and multiple scalable solutions which influence processes, challenge thinking, and ultimately lead to a more bias free hiring process. According to research published by the World Economic Forum, these three factors have benefited the organizations in terms of profitability, innovation, decision making, and employee engagement. Also, the digital transformation spurred by the pandemic in the hiring process has led to strong employee engagement in the organizations. Bringing a similar trend to the fore, a study by Intel revealed that around 81 percent of business leaders said that the technology disruptions which occurred during the pandemic have brought positive impact concerning diversity, equity, and inclusion initiatives in the organization. The root cause of all forms of biases at workplace is human decision making. AI has the potential to enable organizations to make decisions independent of biases that are likely to creep up in the recruitment process when used in the right manner. Analytics enabled by digitization can promote transparency that also helps reduce unconscious biases. The mitigation of such biases is extremely crucial for a firm health. Implementation of strategies involving DEI demands adequate data and information, one of the most indispensable sources of which is the digitisation of the hiring process itself. Furthermore, deeper analysis enabled by AI driven tools to evaluate and analyze skills and aptitudes of multiple candidates to assess their flair, removing the possibility of any bias and making merit the only criterion. HR: In Coming Times AI is here to stay and the technology is already being widely used. The use of AI technology, coupled with digitisation of the hiring process in line with the expansion of the remote working facility, has also ensured a level."
}