{
    "passage":"First of All Happy holi, Now start needed to the precaution dose programmer going by the initial reports of the CMC Vellore mix and match study. That a booster dose of Covishield for those double dosed with Coaxing induces a six fold rise in antibodies questions the current strategy of homologous boosting. However, the Vellore trials found the impact of Coaxing for those administered two doses of Covishield underwhelming. This is where other studies, for Bharat Biotech intranasal vaccine, SII Covovax and Biological E Corbevax, will offer greater clarity given that over 80% adults received Covishield. With the bouquet of vaccines growing, GoI should reveal a timeline for the booster programmer. This will help vaccine companies to calibrate production. The bottom line is India should get caught napping by emerging variants as had happened during last year Delta wave. The US Federal Reserve increased its policy interest rate, the federal funds rate, by 0.25 percentage points to a range of 0.25 0.5%. It the first increase since 2018 and the central bank has indicated that it will be just the first of more increases likely in 2022. America economic context made an increase in interest rates inevitable. The unemployment rate is 3.8%, close to a 50 year low, and annualised inflation is 6%. The influence of the US economy, when juxtaposed with the ongoing Russia Ukraine war, will complicate matters for India economic policy makers. There already an outflow of foreign portfolio investment as capital shifts to safe havens to net FPI outflow in February was $5.4 billion. Outflows, which cause rupee depreciation, along with a surge in prices of commodities such as crude oil, will harden inflation in India. However, RBI large fore reserve of $631.9 billion is adequate to smoothen currency movements. It can partially offset the inflationary impact of a depreciation of the rupee against the dollar. There are two key issues at stake. RBI next monetary policy meeting will take place in the backdrop of a worsening outlook on inflation. Notwithstanding that, there should be a status quo on interest rates. Inflationary pressure is coming through higher commodity costs and supply chain disruptions. Neither problem can be solved through an increase in interest rates. Moreover, local developments provide reason to keep rates steady. CMIE jobs data showed that the unemployment rate increased from 6.6% in January to 8.1% in February. Corroborating it were the PMIs of employment in both manufacturing and services which shrank for the third straight month in February. Weak purchasing power, not overheated demand, is the main problem. The solution lies in fiscal policy, beginning with a reduction in central fuel taxes. JRR Tolkien wrote in his epic fantasy novel The Children of Huron, False hopes are more dangerous than fears. And indeed, history is replete with examples of rulers having made strategic miscalculations based on false hope offered by their allies. Let flip through our history book to understand this. In India, the 1757 Battle of Plessey resulted in a complete defeat of."
}