{
    "passage":"Control and a challenge for organized players. Although many customers now purchase mattresses online, some still prefer to test the product before buying. To accommodate this, companies are expanding their brand stores. The wellness sector is one of the fastest growing D2C segments, with the potential to surpass the more narrowly focused health segment. Despite the challenges, the mattress industry is seeing rapid growth due to the increasing awareness of the importance of sleep and the health benefits associated with quality rest. According to industry reports, the global mattress market is projected to reach $43.43 billion by 2024, driven by factors such as urbanization, rising disposable income, and changing lifestyles. To keep up with the changing market demands, mattress companies are investing in research and development to create new and innovative products that cater to specific customer needs. For instance, some companies are developing mattresses with advanced cooling technologies to combat overheating during sleep, while others are introducing eco-friendly and sustainable options to meet the growing demand for environmentally conscious products. Additionally, there is a growing trend towards customization, with companies offering personalized mattresses tailored to individual preferences and body types. Such products are gaining popularity, as customers are willing to pay a premium for a comfortable and personalized sleep experience. Overall, the mattress industry is evolving rapidly, with new players entering the market and existing companies adapting to meet changing customer demands. As customers become more health conscious and prioritize quality sleep, the industry is likely to see continued growth and innovation in the years to come. Mental health and wellbeing are becoming as important as physiological wellness. The D2C wellness market can broadly be classified under three major umbrellas nutrition, fitness, and sleep which has in the past been the most neglected. Wellness is a relatively price elastic segment in an otherwise sensitive D2C ecosystem. Certifications are critical to establish credibility of a product and command a premium price. Recently, our Honorable Finance Minister Nirmala Sitharaman commenced her budget speech by calling it the first budget of Amrit Kaal. What was particularly interesting is how the Hon blew FM noted that the seven key priorities including infrastructure investment, reaching the last mile and inclusive development are set to complement one another and act as the apt rishi to guide us towards the Amrit Kaal. The Budget 2023 accurately captures the hope filled sentiment of the common Indian who is content with the status quo, but also, firmly believes that our country has much more potential. Despite several global headwinds throughout the recent few years including the Covid 19 pandemic, Russia Ukraine war, and India own concerns with maintaining economic stability in the South Asia region, India has continued to prove itself as an economic bright spot for growth and investments. However, that is not the peak of what India can achieve. It is no doubt that India is still within its PPF Production Possibility Frontier, and there is immense scope to reach a state of higher maximum productivity and efficiency. India revenue per employee RPE one of the wider metrics to gauge productivity has been falling from 2019 to 2021, and the sector wise RPE shows that the manufacturing sector faced a larger brunt of this as it faced a 28 percent decline in average RPE. India labor productivity growth has also shown similar trends, with faltering witnessed even in years preceding Covid 19. As India seeks ambitious."
}