{
    "passage":"Playing field for all talent people with disabilities, new mothers, the transgender community, and the elderly have better chances of finding work today as the use of technology is a great leveler. Sophisticated AI tools ensure that inclusion does not just remain limited to being a buzzword but become a part of the work culture. AI based tools enable organizations to evaluate more applicants per job and also compare between candidates more objectively. Meanwhile, for those at the forefront of this disruption in the HR world, it is like what Charles Dickens wrote in A Tale of Two Cities it was the best of times, it was the worst of times. Best for those who have been agile in adopting digitisation and artificial intelligence driven mechanisms for recruitment, worst for those who continue to hire people traditionally at a time when most of the people don want to step out for job interviews or for the job itself. Not to forget, DEI is most likely to remain key traction for employees while choosing an employer. The war in Ukraine is not just a European event. It has global geo strategic and geo economic implications. The trifecta of problems in Russian mobilisation and logistics, the strength of the Ukrainian resistance and the rapid Western response, has transformed it into real conflict. No one is following these developments more closely than China. The military lessons are important, but even more important are the lessons from the impact of the otal financial war that America and its allies are waging on Russia. China wants to identify and address vulnerabilities in the Chinese economy in order to harden it from future Western assault. This will mean greater, not lesser, economic decoupling with consequent knock on effects for the Indo Pacific economies. A renewed surge in Covid infections across Europe, East Asia and Australia, likely being driven by Omicron stealth sub variant, BA.2, has prompted GoI to insist on greater disease surveillance and genomic sequencing. In countries like the UK, Germany and Australia the new wave has taken shape in a matter of weeks after the Omicron wave of December January appeared to abate. Contrast this to the gap of several months between earlier waves. Admittedly, India Covid trajectory is far from alarming at present. Just over 2,500 infections were detected on Wednesday and the weekly positivity rate is a low 0.4%. However, the surge in other countries does raise worries over the duration of immunity even though most testing positive have mild symptoms. There, however, no cause to jump to quick conclusions or be complacent: Disease behaviour could be getting modified and moderated because these countries have administered plentiful booster doses. Against South Korea 63 booster doses per 100 people the corresponding numbers for other affected countries like UK, Germany and Australia are 57, 57 and 48 respectively. India, meanwhile, is at a low 1.4 booster doses per 100 people. GoI decision to remove the comorbidity precondition for the 60 plus age group to."
}