{
    "passage":"Holi is a festival of colours, love and spring. It marks the triumph of good over evil. On this day king of demons, planned to kill his own son, Prahlad, because he was a devotee of Vishnu. The king asked his sister, Holika, who was immune to fire, to sit with Prahlad on her lap. He meant to set them on fire. She was to survive and Prahlad would have died in this fire. Instead, Holika got burnt and Prahlad emerged unscathed. The story highlights the power of goodness. Prahlad did not defend himself, but the fire lost its power to burn him. It was as if God was supporting him. On the other hand, Hiranyakashyapu, the mighty king, failed every time he used his strength against Prahlad. This may seem like just a mythological story, but you experience the sovereignty of goodness when you live it. We often undermine virtue because we see the good being overpowered by the wicked, and the selfish ones getting away with murder. However, it is not goodness that creates suffering but passivity and lack of use of intellect. Those who are evil minded, tend to operate with intellect, while the good are often led by just noble emotions. The way to go is to harbour noble emotions and use intellect to guide your actions. Krishn was an epitome of this rare combination of a good heart and strong intellect. It made him invincible. The Nawab of Bengal; Sire us Duala, at the hands of the British East India Company. The Nawab was misled by false hope that his previously dismissed commander in chief, Mir Afar, would come to his support. Leon Musk, the richest man in the world, the driving force behind the battery powered Tesla, and pioneer of space tourism, is known for pulling his punches when he gets into verbal wrangles, as he did with fellow billionaire, Facebook founder Mark Zuckerberg. But now the feisty car czar has shown that he no mere motor mouth and is prepared to put his muscle where his mouth is by challenging Russia Vladimir Putin, to a man to man bout of fisticuffs in a bid to put paid to the Kremlin unprovoked assault on Ukraine. Despite his cloak and dagger KGB background and the macho image he likes to project, the Moscow strongman is unlikely to pick up the gauntlet, perhaps not least because, though being a self professed martial arts expert, a couple of years ago he was sent for a toss by a woman member of the Russian Olympic judo team during a practice session, thereby turning a photo op into a photo oops However, if what might come to be called the Leon Example were to be put into general practice, thereby replacing the mass murder of pitched battles by one on one slugfests between two voluntary contestants, it would go a long way to counter the charge that wars are engendered by old leaders as revenge against the young who."
}