{
    "passage":"Factors, augmented with the push to make in India, will ensure play an outsized role moving forward. To put it in another way, the in the near future will be at the forefront of making in India, but for the world! The evolution is already evident in the maturing focus areas for GCCs. Surveys conducted among and global leadership in recent years indicate that 2 out of 3 of these centers are prioritising building new capabilities and Centers of Excellence Comes in the next three years, and digital capabilities like Data & Analytics, Cloud Engineering Cyber security and Process Automation are in high demand. The growing ask is reflected in the latest projections that state and digital engineering revenue will account for a significant portion of the revenue in the coming years, growing at a of 20. As more companies become comfortable with decentralised teams, functions such as that historically stayed close to the headquarters are today slowly but surely moving to their. In fact, more than 50 of the in India today operate as technology centers of expertise of some form, and among the set up in the immediate years preceding the pandemic, about 50 were Capability Development Centers, and about 25 were focused. This explains why, according to the latest demand market pulse survey conducted by Deloitte and of the global leadership stated that one of their immediate priorities is to globalize their R&D footprint through in house centers or service providers majority of which happen to be based out of India. All these paradigm shifts help make sense of why the study of investment priorities as a part of this survey also showed that the India centers are expected play a key role in driving digitalising end to end product lifecycle as stated by 42 of the respondents, building a technology ecosystem 40, and developing key skills and talent for the organization 40. A logical outcome of this push for cutting edge digital and capabilities is a boost for the overall ecosystem owing to the co sourcing opportunities. No surprises therefore that 80 of the respondents of the survey mentioned above stated that their organisation is poised to adopt or has already adopted a co creation model with startups, engineering service providers, academia, or even competitors to accelerate their initiatives across the board. There has been a marked increase in the number of Comes and other such collaboration initiatives between companies and educational institutions in India. But the biggest winner in this ecosystem is the startup community. There appears to be a symbiotic relationship between and startups because each one vision can be achieved through mutual contribution. On one hand, are going through a metamorphosis by adding strands of thinkers and influencers in their after historically having been doers and optimizers, and on the other hand, are aspiring to be agile and nimble, and both of these are typical of a startup ethos. Startups seek sandboxes, markets, data, domain and sectorial insights to make their products sharper."
}