{
    "passage":"The Budget has been widely praised for avoiding populist freebies before the coming state elections and focusing instead on a big investment thrust to accelerate economic growth and lift all boats. The black spot is the failure of privatisation this year and diminished hope for the future. There is by now an established template of reactions to the Union Budget which is drearily familiar to Indians. The government side is generous in the use of expressions such as bold, progrowth and pro people to describe the annual exercise. Conversely, the Opposition is never miserly in using terms such as inflationary, anti people and anti poor to berate the Budget. When he was in the Opposition, Aral Bihar Vajpayee who had the most fleeting of interest in matters to do with high finance was known for his stock remark: Garb key pet me let kicking the poor in the gut. Leon Musk, the world richest person and CEO of Tesla Motors, does shy away from expressing his opinions on Twitter. Some of his tweets have even got him into trouble in the past, including stiff fines from stock market regulators. Last month, he responded to a Twitter user question about why Tesla was in India yet with this tweet: till working through a lot of challenges with the government. First off, it is remarkable for a CEO of a prominent, private company to publicly share their challenges with the Indian government. No prominent Indian company CEO would do it, for instance, for fear of repercussions. Perhaps, one of the tests of being truly business friendly is this: Can Indian business owners publicly share their genuine views on government policies? Given the rampant rise from our industry bodies after every budget, that day still seems a bit far away. The current privatisation approach is a proven disaster. We need something different. One solution would be to sell 1 of the shares of selected PSUs every month at the going market price. That would avoid accusations of underpricing and cronyism. Right now, we hear constant fears of what might go wrong and how structures and procedures must be devised to avoid scam accusations and ensure a good sale price. By all means, address those issues, but meanwhile, keep selling 1 per month so that money for fresh investment keeps rolling in and is not hostage to constant roadblocks from vested interests. Nitti Analog suggested an approach of this sort in the Arvin Panagariya era. The Orissa High Court has recently passed a judgment to uphold the Orissa University Amendment Act 2020 that entitles the Orissa State Public Service Commission to carry out centralized recruitment of teachers in state Universities of Orissa state along with certain other formative changes. This came in wake of the petitions challenging the centralization of teacher recruitment in state Universities. Although the states like Bihar and Jharkhand in proximity to Orissa already have a practice of central recruitment of teachers in higher education, it has elicited a debate over."
}