{
    "passage":"In Jammu and Kashmir to Rs 15 crore from the existing Rs 5 crore. This scheme is an important tool for the promotion of peace and development in the region. The budget will be used to upgrade sports infrastructure and facilities in Jammu and Kashmir. While the government initiatives augur well for the growth of sports infrastructure in the country, a renewed focus is required for non student rural youth, who, at present, are engaged through community based youth clubs. Similarly, while the allocation of Rs 13 crore for the National Centre of Sports Science and Research is commendable, the government should allocate 10X, and attract more investment to match the expenditures made by developed countries to instill a sports culture that promotes healthy living and an active lifestyle, and ensures that excellence is achieved by design. The aim to establish over 1,000 sports centers is also a welcome step. It was also a good move to provide funds directly to the National Anti Doping Agency, ensuring sporting integrity is well maintained in India under independent supervision. This will also help the Sports Authority of India (SAI), our apex national sports body, focus on its core purpose of elite athlete training and management for sporting excellence. Sports inclusion also means giving support to our Para athletes. The government aims for 20% more Para athletes in Para sports disciplines, which will require a more nuanced approach and provide our special athletes with the requisite infrastructure. Social infra is critical While the plans to monetise infrastructure like sports stadiums may bring in more competition, existing bodies like the SAI, which were set up with the aim of providing infrastructure and equipment support, coaching, and other facilities, can be further strengthened. Another welcome move in the budget is the Rs 100 crore grants for the National Sports University, established by the enactment of the National Sports University Act, 2018. The first of its kind in the country, it focuses on high standard infrastructure for the development of sports sciences and athletes training. At the same time, it important that we have well qualified professionals running sports institutions. While the government should keep increasing the sports budget, it should also consider incentivising the participation of private sector companies in developing sports infrastructure. Many private bodies, such as Reliance Jio, JSW Foundation, and Herbalife, are promoting athletes and sports, either in collaboration with the government or individually. Furthermore, the government needs to ensure that the sports infrastructure is easily accessible to people of all socio economic backgrounds. Under the Fit India Movement, SAI stadium facilities are available to non SAI coaches to train their wards. However, such facilities are not many to meet the purpose of making India truly pursue a healthy & active lifestyle. What is required is to develop at least one all round sports facility in every district headquarters in India, accessible for all. Such steps will go a long way in not only helping the development of sports in the country."
}