{
    "passage":"Investment Allocation towards food subsidy and MGNREGA together has been lowered by about Rest 1.05 lakh core. In addition, spending on vaccines and Air India will fall in 2022 23, thereby freeing up resources that will be spent on roads and railways. There are two assumptions here. First, there will be no more shocks. Second, growth will reduce the need for high level targeted support. Those critiquing cuts in welfare spend should remember that Go can always spend out of Budget if the need arises. What to make of the 30 tax on gains from crypto assets Post budget, FM said taxing gains on digital assets does mean legalising them. That correct in the sense that any gain in income can be taxed. But it is reasonable to think that having brought crypto assets under the taxation regime, Go will subsequently declare the underlying asset to be legal. Therefore, unless there a nasty surprise, the Budget has made the first move towards accepting the reality of crypto assets. That a smart call, as is making the new tax applicable from March 2023. This will give time to crypto asset holders to adjust their portfolios. The crypto move aside, if RBI launches its digital currency in the next financial year, India will have moved up the block chain technology ladder. Disappointments go seems to have lost enthusiasm for privatisation, perhaps fearing it can become an electoral liability. But then again, with markets choppy, it not the best time to sell assets anyway. There plenty that good in this Budget if Go can spend the entire cape it has budgeted for. Given elections in five states, including those in UP, the Budget seems to have been prepared on another planet. There are no pre election lilies, not much pandering to the voter endless appetite for subsidies, and almost nothing at all for BJP core middle class constituency. Even that punt you may have planned on crypto currencies now comes with a heavy tax bill 30 plus surcharges and chess with no loopholes. Regardless of whether you gain or lose from crypto trades, net you lose, either from adverse market movements or a capital gains tax. The government has taken a heads I win, tails you lose attitude on cryptos. When all negotiation efforts had failed and war became certain, both the Kaurav and Pandav cousins decided to approach Krishn for assistance. Duryodhan, representing the Kaurav side, arrived first; Krishn was asleep and so Duryodhan took a seat near the Lord head. Arjun followed, and placed himself at Krishn feet. When Krishn woke up, his eyes settled first on Arjun. Duryodhan, however, insisted on the first come, first served basis, and therefore, believed his claim on Krishn help to supersede Arjun. The wise Krishn recognised both claims. Duryodhan had arrived first, but Arjun had been seen first. Both would receive his help. And stating this, he offered them a choice: One side could have Krishn vast army all hardy, skilled and armed Yadav."
}