{
    "passage":"Richly discussed and debated in international policy circles from a variety of angles, what has perhaps received less attention is the priority India placed on women-led sustainable development and economic empowerment. Founded in 1999, the G-20 is an intergovernmental forum of 19 countries and the EU to tackle major challenges faced by the global economy. Key engagement groups such as Women20 (W20) and G20 Empower are entrusted with mainstreaming discussions on gender equity and translating them into actionable goals such as for the G20 Leaders Declaration. As an interdisciplinary Women and Cultural Studies scholar with a background in Economics, and theoretical and applied inter-sectorial work at the intersections of economy, polity and society, I was delighted that the five priorities of W20 are women entrepreneurship, including micro and Nano enterprise, women leadership, education and skill development, bridging the gendered digital divide, and addressing climate change. An in-depth article in The Economic Times last month quoted the United Nations Assistant Secretary General and Deputy Executive Director of UN Women, who termed these efforts remarkable, encouraging India G-20 Presidency to share developmental stories and pragmatic interventions that have already worked and disseminate technical and practical knowledge that can help the rest of the world. ( India G20 Presidency a Real Opportunity for it to Share Lessons from Global South with Others, Says UN Official. ) Indeed, these global priority areas and their local applications are critically important for advancing G-20 agenda. While incentivizing entrepreneurship is vital for economic growth, the inclusion of micro and Nano enterprises allows for targeted policy benefits to flow to the most disadvantaged in the entrepreneurial ecosystem cobblers and carpenters, tailors and tiny toymakers to whom banks and non-banking financial companies (NBFCs) generally do not lend. Microfinance and community banking has served as a key tool for financial inclusion of the socioeconomically marginalized, including the poorest women, in many parts of South Asia and the world, since their lending policies do not include standard collateral and related requirements an oft-quoted example was Bangladesh Graeme Bank before it ran into challenges. But microfinance institutions also have their own limitations, due in part to how they and their small borrowers cannot benefit from economies of scale. The most efficacious as well as socio-economically just financial inclusion practices must therefore offer a combination of targeted initiatives for low-income women along with inclusion in the mainstream economy and banking system rather than operating solely through separate silos. The same is true for education and skill development. In many societies, higher education has traditionally served as a marker of status; and its limitations and scope for improvements notwithstanding, India highly subsidized public education did help many earn university degrees that would credit to such policies; the praise for public education is mostly reserved for European countries while keeping the focus on India backwardness in a continuation of a colonial gaze. That said, it is also true that degrees do not mean much if there are no matching jobs or if they cannot put."
}