{
    "passage":"Globally saw a positive sentiment across the board and was picked up by the stock markets. Today with the virus losing its grip, the industry it spawned is also dying out, making it difficult for the companies to sustain the growth it achieved over the last few quarters. This is most glaringly evident in the stock market valuations which sent most of the counters under stress. Given the sheer size of the Indian pharma sector, its achievement, promises, and scope, that today at par with others, including infrastructure, power, and technology, be it concerning exports or domestic sales, there no way that even the thought of a reversal can be entertained. On the contrary, entities in the industry ought to take steps that would keep earnings high and, with it, the stock market valuations. From experience, we suggest specific steps. First, diversify! With the world slowly going flat in matters relating to economies and markets, Indian pharma ought to look to markets all over the planet. An emerging and relatively untouched market for instance is that of South America, with sizable demand likely to exist in places including Central America, Brazil, and Mexico. In ways more than one, they resemble the Indian market for pharma products, focusing on cost effective and reliable solutions, be APIs, Formulations, OTCs, or Generics. India could fit the bill with state of the art capacities. A recent study in 2020 has placed Latin America at 3.5 of global pharma demand in revenue terms. Of this, Brazil leads the way with USD 25 billion, followed by Mexico at USD 14 billion. While Brazil has a note worthy local production, it depends mainly on imports for APIs and multiple finished products. Second, diversify in matters related to drug and medicine delivery! While it easy to consume a medicine infused fruit flavored chewable gummy, a rugged, oblong tablet that hard to swallow is doing just that to the industry making things difficult. The same, in myriad forms, applies to injections, and external applications, including pastes, creams, and potions. While the former, i.e., injections, are painful to most, the latter brings with them a degree of discomfort with clothes and accessories getting stained. For these, the market is opening up with a range of new age patches and creams that promise to cure at the right place at the right time minus the discomfort. Its best example is the pain relief patch which can be applied to any body part for acute pain relief. These essentially bring convenience to the world of medicines that, till now, were all dry and clinical. Besides changing forms, some forms of essential medications, by going convenient, have also moved into the OTC zone that sees their off take being any day higher than those in regular medicine shops. Third, innovate with the digital supply chain! Remember e commerce giant Amazon! They started as sellers of books and, with time, went on to become e sellers of everything under the sun. In days to."
}