{
    "passage":"In today digital world, data is the foundation and currency upon which information is transacted. The vast amount of data that organizations process and store is growing, increasing the need for privacy practices and security. Computing environments have become extremely complex and routinely include numerous data sources from the cloud, corporate data centers, Iota sensors, third-party servers and other platforms. This complexity increases the risk of attack and makes it more difficult for businesses to monitor and protect their data. It is crucial for organizations to incorporate data security and privacy policies into a robust data governance strategy to prevent data leakage and achieve regulatory compliance. Many companies believe their data security policies cover data protection and vice versa, but data security and data protection are not synonymous. There is a distinctive difference between data security and data protection. Data protection covers procedures and guidelines that control the collection, storage, disclosure and use of personal data (PII), sensitive personal data (SPI) and company information. This refers to the rules and regulations that ensure that personal information is managed in the same manner as the data subject preferences. According to the Verizon Data Leakage Investigation Report (DBIR), between 2019 and 2021, a total of 79,635 reportable data breach cases occurred worldwide, resulting in losses of up to $4.2 billion. As with last year, financially motivated attacks were the most common, and organized criminals remain number one. Data security is commonly referred to as information confidentiality, availability, and integrity. It all about practices and procedures focused on protecting sensitive or confidential data from unauthorized access, cyber-attacks, and accidental or intentional data loss. Data security also ensures that your data is accurate, reliable, and available to authorised users. Everyone, from individuals to high-level businesses and governments, can be exposed to data breaches. More importantly, anyone can endanger others if not protected. In many cases, a small password change cannot protect against a data breach. From global corporations to small businesses, data breaches can have a devastating impact on a company reputation and financial results. And beyond the operational or financial impact, reputational impact can last well beyond the incident itself. Breaches can lead to the exposure of social security numbers, personal information, and bank details. According to a Checkpoint report, Indian organizations are hit by an average of 213 ransom ware attacks each week, with 2021 seeing the most ransom ware attacks. A new law, the Personal Data Protection Bill (PDP), is currently being submitted to Parliament, suggesting a major overhaul of India current data protection regime. It proposes that data is processed by enterprises with restrictions to ensure that only the data needed to serve stakeholders is collected. It also includes requirements for data localisation and the appointment of data protection officers within an organisation. It is important for any organisation to build a resilient business model consisting of risk assessment, actual response, planning, and testing to validate it. With onboarding due diligence and constant monitoring and oversight, ADP has always been."
}