{
    "passage":"And gas. Global investors are therefore nervous and are taking money off the table wherever perceived risks are relatively higher. Shakespeare was twisted to disperse the hundreds who camped outside New Zealand Parliament to protest against Covid related curbs. In an unlikely proxy for water cannon, the authorities used music to ear drum them out, playing old songs and the 1990s earworm Macarena on a maddening loop. They also slipped in vex messages for good Measure for Measure. However, the plan did work on the Twelfth Night or any other. The hope of here today, gone tomorrow came a cropper. Instead, it was a case of All Hell That Ends Hellishly. The targets counterpointed with their own aural bombardment, belting out Twister Sister Were Not Gonne Take it. The rousing American civil rights anthem, We Shall Overcome would have been more in tune with the context. Is the West now in the grip of an anti Covid restrictions wave At NZ other polar end, truckers blockaded the US Canadian border last weekend. They dispersed peacefully as the police moved in. Not so the humongous French convoy which thundered into Paris, defying barricades, tear gas and a specially mobilised 7,000 strong gendarmerie. Clearly Macron did have faith in Macarena to quell what become today avatar of WWII doughty French Resistance. On the same principle as homoeopathy or the hair of the dog that bit you hangover remedy, using your music to counter heir music has had several improves. Remember the 1990s, when rat politics played the opening alas to Hindustan in Maharashtra, the azaan was the red raga to the bullish BAL Thackeray. The Shiv Sena supremo ordered it to be drowned not in the clang of an ordinary aarti, but in the clamour of an amplified maha aarti. You might call it For Whom the Bal Tolls. Today electoral equivalent is the raucous whataboutery that is now more shrill, more besura, more besharam than ever in its discordant notes. In contrast, NZ idea of aural disarmament is almost Gandhian. However, music being used as both offensive and counteroffensive also comes with a Mahatmaesque warning An earful for an earful can make the whole world deaf. The first noble truth of the Buddha, All is suffering, implies that our lived life is fraught with pain and misery. Suffering is a permanent human condition. Even what we call happy and content moments are beset with the painful awareness that they would soon come to an end. Like the Buddha, Jiddu Krishnamurti also holds that everyone is in despair, sorrow, and frustration, but unlike the Buddha, he does not believe that the cause of human suffering is avidya, ignorance. Nor does he believe that human suffering can come to an end by activities like satsang, kirtan, reciting a particular individual mantra, or offering collective prayers. Without going deeper into the reasons for the chaos and misery all around us, we just assert that human suffering is because of our not following the dictates."
}