{
    "passage":"The future of home security lies in smart homes. A secure home security network can help prevent or reduce the risk of getting hacked and possible break INS today. With timely alerts, accessibility at a click, and easy ways to monitor your premises, smart security solutions are becoming a necessity. Convenient, effective, and accessible, most new age security systems rely on state of the art technology to help keep your home secure and protect your family and property. To cope with increased crime and safety concerns, these home security systems offer a plethora of tech driven features that ensure you and your loved ones remain connected, alert and protected. With features like motion sensors, high quality day and night video surveillance, and automated door locks these smart security solutions help empower the user and can easily be linked and controlled through an app. Programming and configuring settings to one needs, activating, and even disarming systems can now be done remotely. Proactive real time alerts or notifications help avoid fatalities and warn against intruders. These critical updates are crucial especially as most families have young children or elderly family members at home. To further ease and make monitoring practical, remote viewing options allow one to watch over their property with ease from anywhere, at any time. Effective solutions to protect your home security from getting hacked: Indian sports has witnessed many glorifying moments in the last 15 years. The year 2008 was a game changer for Indian sports when shooter Abhinav Bindra won the first individual gold for the country at the Beijing Olympics. The athletes from India have won 15 medals ever since, with the latest feat being one gold, two silver, and four bronze medals at the 2020 Tokyo Olympics (the highest for the country in one game). Out of these total medals, Indian women athletes have contributed nearly 50%. Prior to the 2008 Olympics, India had won just 17 medals, 11 of which came from hockey, with one off successes in sports such as wrestling, tennis, weightlifting, and shooting. Now, let look at India budget allocation for sports over the years. Let see if there is a correlation between the money that the government has spent on sports and Indian athletes performance on the global stage. Also, if there is a connection between the budget and India getting fitter and more proactive on the physical activity front. Let look at how much money India has allocated for sports and physical activity over the last 15 years. It was Rs 708 crore in 2007 08, but it swelled to Rs 3670 crore in 2009 10 thanks to Indians preparing for the Delhi Commonwealth Games. It was Rs 2841 crore in 2010 11, but it went down to Rs 1121 crore in 2015 16. With an increased interest in the Khelo India programme, the government also boosted its budget substantially to Rs 2636.06 crore in 2019 20. There was a significant dip to Rs 1800.15 crore in the corona virus."
}