{
    "passage":"Affected financial year. The government has almost doubled the sports budget since then. India is reportedly the most populous country in the world. Despite its large population, the government has often been questioned for its lack of adequate and sustainable investment in the sports sector. In the last decade, while sports budget allocation in India has grown significantly, it is minimal compared to developed nations such as the UK, the US, Japan, and Australia. India sports budget for saw an 11% increase from last financial year. It reached crore this year. Out of which, Rs 1000 crore has been set aside just for the Khelo India project. If we analyse India current sports budget of crore for a population of more than 140 crore, this means every Indian is allocated Rs 24 per year for sports. When compared to leading sports nations such as the United Kingdom and Australia, India expenditures are significantly lower. The UK sports budget for 2022 23 was. Way forward: Khelo India While Finance Minister Nirmala Sitharaman did mention a word about sports in her budget speech, the budget fine print indicates that the focus is on boosting the Khelo India programme, which was started with the purpose of improving mass as well as youth participation in sports and promoting sporting excellence. Just in a year, the government has increased the fund for Khelo India the National Program for Development of Sports by more than 65%, from Rs 600 crore in FY23 to Rs 1,000 crore in FY24. The Khelo India programme aims to achieve the twin objectives of broadening the base of sports in the country and achieving excellence in sports. The government is hopeful that through such initiatives, a sports culture will be developed in the country. Whether these funds boost sporting infrastructure, talent development, and the overall ecosystem, will depend on how they are allocated and spent. While the government is clear that it wants to reap the benefits of sports through its cross cutting influence, such as gender equality and national integration, it would be best for India sport development and future sporting excellence if grassroots infrastructure and women in sports receive more funds from this allocated outlay. Mega event push The government aims to organise three national level Khelo India Games the Khelo India Youth Games, the Khelo India University Games, and the Khelo India Winter Games in 2023 24 with a total of over 10,000 participants, hoping to provide a robust competitive platform to encourage talented athletes across the country. The larger aim is to get a 3% increase in the number of records (national records and/or games records) broken during the national event. The target of over 50 women competitions with over 12,000 participants and a 20% increase in the number of athletes from extremism affected and other disturbed areas participating in events will promote inclusion through sports. A clear reflection of this approach is that in FY24, the government increased the budget for the enhancement of sports facilities."
}