{
    "passage":"In leather rather than what the wise men suggested he do, which was to put the entire world in a pouch Hearing a section of American politicians, principally of the Republican persuasion, trying to diagnose the cause of the uniquely American way of dying, namely getting shot while in school, reminds one of that fable. Schools, they say, should be locked in like a prison, with a single entry and exit. It might make the school a deathtrap in a fire, but hey, you asked for a solution. Or better, equip every school teacher with an AR 15 because obviously what would make a school safer than gun toting, armed to the teeth math teachers, with the armory right next to the library It good business for the gun manufacturers, why sell to the shooter when you can also sell to the school There should be stringent background checks and mental health checks even though each and every school shooter used legally procured guns and would not have failed a background check. The wise men in the fable were not so bright, but here, it is not that the politicians do not know, they know perfectly well because many countries which have outlawed firearms have seen school shootings go down to zero, but yet, yet, nothing happens, except yet another tragedy on an epic scale. Baby food may be sold out in today USA, but assault rifles are always available. For an outsider, this is possibly the most difficult thing to understand about the American way. It is a country that seemingly cares so much for the life of its own citizens that they put safety stickers everywhere, and will even bomb a country for harming an American citizen, they don even care if it the right country or not. However, they are willing to put up with the slaughter of innocent children, in order to preserve a notion of individual liberty, a notion that has become an article of faith. Like the worst kind of blind faith, here is no America without guns cannot be reasoned against, and there are financial interests in American politics that ensure that the blind faith morphs into fanaticism, which is why America will continue to stay in this relentless cycle of violence and grief, despite a very simple solution staring at it in its face. Spirituality entails looking inwards to assess our thoughts, shed negativity and work toward imbibing purity and positivity, moment to moment. Self control, quest for truth, and intuitive wisdom are all embellishments that one gathers during the course of one spiritual evolution. Over a period of time, spirituality paves way for a mind that thinks on the lines of inclusiveness and is full of love. These virtues are at the core of all religions. Acceptance of the fact that all religions lead to the common goal puts an end to all differentiation. And one realises within the presence of Ek Omkar the universal divinity. It is such a liberated."

} 