{
    "passage":"Bucket but to swim in the river, you need faith. It is faith, not belief that we need, if religion is to be the running river that nourishes life and not a pool of the past ness of it. Belief freezes us in the past; faith enables us to swim in the river of life. The passing away of Lataji pained many a music lover from all across the globe. There were music lovers from all the languages in India in which Lataji sang and many from across the Indian frontiers who understood what it meant to sing 30,000 songs in 36 languages successfully across eight long decades. Will there ever be a parallel to this feat my digital rational mind with all the artificial intelligence and Google at its disposal chooses to answer this with skepticism. Lataji was one of the last of Indianness personified in the manner as we know it, from our heritage and cultural ethos over the documented period of more than 3000 years. She came from a poor family of music lovers who continued music as a tradition more out of love, passion, dedication, hardships and if all this begets a living, so be it. She lost her father at the tender age of thirteen, yet pursued her destiny which was soon to fall in line. There is no doubt that the talent she possessed could only have been bestowed upon by the almighty, still through her sheer diligence, commitment and Sadhana she kept improving and improvising with time, so as not to be just commercially successful in the Cinema world but also to keep alive her passion for Indian classical music and all that which is not in demand and popular. It is this aspect of her which made her a legend with no parallel anywhere in the world of music. She started singing on the stage in the 1930s and continued till the second decade of the 21st century, a feat unparalleled. She inspired and entertained a generation which listened to age Malik tree banded hum, to the last song dedicated to the Indian army perhaps in 2019. Despite the fact that with each decade new realms of music influenced music lovers, she kept working with music directors of every generation making her almost indispensable and lending her voice to every successful female star of the Indian cinema of the last seven decades. The list would be endless. Besides the Hindi mainstream cinema for which she sang the maximum number of successful songs, her forays into ghazals, regional Indian languages, classical Indian music etc. would all be in the eternal hard disc of music if it were to exist anywhere. However, it is for the other aspects of her personality and attributes that I write my thoughts. With all the commercial success she was as humble and polite as one could be. Never a shade of pride, vanity or an air of larger than life feel around her. She would encourage and imbibe."
}