{
    "passage":"Therefore, these online games of skill need to be treated differently than online games of chance like lotteries and casinos. As afore since online games of skill have been held to be legitimate by the Supreme Court of India and afforded protection under Article of the Constitution of India, this affirms the legitimacy of their business. Gambling operations like lotteries, casinos, etc. are considered res extra commercial which means that they do not have the right to trade and profession guaranteed under the Constitution like online skill games. The children of short tempered, over cautious and nervous parents may assume similar characteristics when they grow up. Psychologists, therefore, prescribe a code of conduct for parent behavior in front of their children. They must exude confidence, self belief and hope, especially in difficult situation, so that the children emulate these qualities. They must be taught the importance of being positive before, during and after the performance of a task. There is no better education for a child than watching his parents come out of a tough situation by means of earnest endeavors. Such success not only gives more joy but also increases self confidence. Stretching s specific tendon or muscle can improve the elasticity of muscles, which in turn helps in achieving a comfortable muscle tone. There are several benefits of regular stretching, and it should be an integral part of every workout program. It not only helps increase your flexibility online games of skill have a transparent and well defined execution format. The players pay a participation fee to enter the contest. This participation fee has two components. First component is platform fee which is retained by the platform operator. The second component is the prize pool money that gets collected in a trust account held by the platform operator, which eventually gets distributed to the winners after the contest, is complete. Online games of chance on the other hand, have varying systems in place, depending on the game. Lottery encompasses a distribution scheme wherein the participants pool in money in the form of tickets, and this is attributed to winners based solely on chance elements. Casino games harvest revenue from all amounts wagered in the casino, after paying the winners their victory spoils. Casinos have to pay tax on initial deposit, whereas the proposed levy of 28 GST on online gaming would mean that the gaming platforms shall have to pay tax on the entire consideration every time a user enters the contest. Such taxation on online gaming, which in fact is a mass entertainment medium that spans over 40 core users across different demographics, likely to put the entire industry on a back foot compared to casinos which is accessible only to few high net worth individuals and available only in a few Indian states. Transaction Means For skill based online games, transactions happen via the digital operating platforms itself. With technology, all platforms are moving to strengthen their transactional portals and increase security, in order to curb."
}