{
    "passage":"Lover of the sport in the country. While there was a great deal of understandable anguish at the suspension and its consequences, there are those who have sought to justify Fifer decision to suspend in the first place. Cleaning up football administration Just to recap, in May this year the matter was taken up by SC and the CoA was requested to draft a new constitution for the federation in terms of the National Sports Code, conduct elections under the said constitution and to then hand over control to the newly elected body. There is a famous observation by British writer and philosopher Aldous Huxley: Every individual is eventually a bore. It not a particular person who boring. We all tend to lose our novelty with the passage of time and become a bore to other people. Hardly anyone in this world retains his charm till the end and that an art we are all so bad at. Why does almost every person eventually become a bore? Boredom is directly related to lack of novelty and monotony. Human beings look for novelty in a person and relationships. When we don get that, we get bored. We also get bored with a person or object due to over familiarity. The Bard of Avon aptly said, Familiarity breeds contempt. It indeed does in the long run. When you constantly bump into the same person, you later realise that there no excitement anymore and no newness. Why does love often taper off after marriage and a husband and wife become boring to each other? The reason perhaps is monotonous familiarity. a primarily herd-animal, is said to change its group after every six months. It remains with elephants but the set of elephants changes after a period. In Arabic, there is a saying, Inseam was males tabdeeliyaat keep changing your company. Same people, same ideas and same thoughts provide nothing new and offer no new insights after a certain period. One begins to get a kind of In the Burmese Buddhist religious order of the Mahayana sect, every monk is sent to a new monastery after a period of nine months. This goes on for the first 24 years of monkhood and is called Bonita in Burmese. The purpose is to expose the monk to new religious orders and philosophies continuously. The best way to evade boredom is to be in a state of constant flux. Most of us spend our entire lives with a set group of friends and people. While it shows our commitment in a socially accepted manner, it also underlines mankind inherent fear of embracing the new and novel, which is not desirable for one intellectual and qualitative development. Many a times we know we are getting bored with a situation set pattern or a person, but we deny that because we feel that it rude on our part to leave and go away. It not rude. Only by calculated distancing, a term used by Austrian psychologist Alfred Adler, from."
}