{
    "passage":"But also in creating job opportunities and guiding India to emerge as a sporting global superpower. Water, water everywhere and not a drop to drink this predicament of the sailors in Samuel Taylor Coleridge famous poem is a portent to our collective futures; one with little to no access to safe water. In 2019, Chennai, a city that receives twice London average annual rainfall at 1,400 mm, had to meet its water needs by trucking in 10 million liters of water a day. The 2018 drinking water crisis in Queen of Hills Shimla made international headlines when policemen were deployed on the ground to manage water distribution. The NITI Aayog 2018 Composite Water Management Index (CWMI) depicts an unsettling picture of macro water availability in India despite being home to 17% of the world population; it has only 4% of the world freshwater resources. The total water demand in India is projected to increase by 22% and 32% in 2025 and 2050 respectively and, by 2050, 85% of this demand is expected to come from industrial and domestic sectors alone. Among the regions, the south and the northwest are expected to face the worst in next two years. About two lakh people die every year due to inadequate water, sanitation and hygiene and ~820 million Indians living in twelve river basins across the country have per capita water availability close to or lower than 1000m3, the official threshold for water scarcity as per the Falkenmark Index. To address this looming water crisis and ensure water security, it is imperative to devise a holistic urban water management system that can help balance biodiversity by protecting and restoring the health of waterways and wetlands, mitigate flood risk and damage, provide for sustainable and resilient communities, promote sustainable development goals (SDGs), and address the needs of the last person in the queue. Some of the solutions available to this end include: Rejuvenation / conservation of water bodies: Replenishing and restoring the health of natural water bodies and wetlands is the single most effective way of securing a safe source of water. Cities, like Bangalore, have 210 lakes, covering 3,622 acres with a capacity of 35,000 million ft3. Long term efforts such as Namami Gange are also bearing fruits. However, for more localized solutions, it is important that traditional water storage structures such as vavs and baolis are rejuvenated and maintained. Rainwater harvesting: India receives bountiful rains last Monsoon; India received 925 mm rainfall in just four months. A part of the immense potential to create sources of water through rainwater harvesting is being realized as on February 2, 2023, more than 1.19 million water conservation and rainwater harvesting structures have been constructed across India. Government initiatives: In the past few years, the progress towards providing piped water supply and last mile delivery of water has been stupendous. The one of its kind Jal Jeevan Mission supplied tap water to 10.64 crore 55% households in rural India until November 2022 and more than 15."
}