{
    "passage":"Restaurateurs argue they should be able to decide what all services of an app they need rather than all the features be forced on them. Another major concern is the right commission to be paid to the food apps. NRAI has written to CCI and is working with online aggregators for an amicable solution while firmly insisting that deep discounting is not sustainable. India has the potential to be the food capital of the world. We can be one of the top culinary destinations of the world. Some of the top cultural powers of the world are known for their restaurants. We need to ease rules of operation for our food industry and make it easier for industry to survive and thrive. Having witnessed the worst during the pandemic, food industry is seeing impressive rebound. The growth is being seen across states and every tier city. This is the moment for the government to handhold and propel this industry to great heights and make it one of our biggest tourism attraction and one of top employment and revenue generator. either for the Government or the Statutory Corporation. We, therefore, direct the learned Single Judge of the High Court to proceed further with the execution of the award expeditiously and take the same to its logical end in accordance with law as early as possible and in any case, within a period of three months from today. Therefore, these judgments of the Hon blew Supreme Court show that not only do the Courts have very limited grounds under which they can interfere with awards passed by Arbitral Tribunal, but also with respect to enforcement of arbitral awards, the same should be enforce without unnecessary delays. the Hon blew Supreme Court has noted that a number of applications under Section and have been pending in various High Courts. In some cases the pendency has been more than four to five years. Accordingly, the Hon blew Supreme Court directed that the High Courts should decide within 6 months, all the Section applications which have been pending for more than year. The Court observed Therefore, if the applications under Sections of the Arbitration Act for appointment of arbitrators are kept pending for a number of years, it would defeat the object and purpose of the enactment of the Arbitration and Conciliation Act as well as the Commercial Courts Act. The litigant may lose the faith in the justice delivery system, which may ultimately affect not only rule of law but commerce and business in the country. Therefore, it is evident that both the Legislature and the Judiciary have acted proactively in making sure that arbitration matters are decided at the earliest and with the least possible interference by the Courts. This will promote the culture of Arbitration in India and greatly benefit the parties involved in arbitration. At a dinner, while showcasing his new menu, in between explaining a dish and pointing at happy diners, a restaurateur remarked food and beverage industry is the."
}