{
    "passage":"The marriage age to remain at 18 if families are involved in arranging it. However, they want it to be 21 if it a court registered marriage as it lowers the possibility of elopement. Here, elopement is chap speak for castigating those choosing their own partners. The position of chaps embodies all the regressive traditions that deprive women of their individuality and keeps them tied down. Haryana chaps are not an exception when it comes to suppressing individuality of women. There are many other social institutions across India that carries on in the same way. Sadly, the political class lacks the courage to confront these institutions. The least they can do is create an economic environment that allows women to break free of tradition shackles. Imagine this you re 17, preparing to go to the UK for your studies, and someone sends you the link to a news article about a developing Covid 19 situation in London that might affect your travel plans. You click on the link and you re asked to share your date of birth before you can read the article. You fill that in, and the website asks you to get parental consent to read it. The same thing happens as you go from site to site to get this information, before you get fed up and ask a parent to read it. In the biblical narrative, we read about the wise men from Persia who brought gifts to baby Jesus. They brought Him gold, frankincense and myrrh. These gifts hold a lot of significance and meaning. Gold represents royalty. This is evident because these wise men came looking for a king and they went searching in a palace. In fact, their query in Herod palace was where he who is born king of the Jews While is this unsettled King Herod, the biblical account of Jesus kingship is subversive. This king was born in a borrowed manger. The kingship ascribed to Jesus is not political power. Just before Jesus crucifixion, the Roman governor, Pontius Pilate, asked Don you realize that I have the power to release or crucify you Jesus replied You would have no power over me at all unless it were given to you from above. Jesus kingdom is spiritual, and not geographical or political. A quote attributed to the French emperor and General Napoleon Bonaparte is insightful Alexander, Caesar, Charlemagne and I founded empires. But on what did we rest the creations of our genius upon sheer force. Jesus Christ alone founded his Empire upon love; and at this hour, millions of men will die for him. This is rare royalty. The second gift placed in obeisance before the baby was frankincense. The resin like material is fragrant and is obtained from Boswell trees grown and traded in the Arabian Peninsula for about 5,000 years. This gift reminds one of the practice of the high priest, who went before the altar of God to burn incense. The role of the high priest."
}