{
    "passage":"Ever evolving consumer interests, while a majority of them have conducted massive layoff drives to cut down their expenses. Further due to the harsh funding winter, startups are cash trapped and this could have a big dent in the ecosystem. At this time, it becomes imperative for talent managers to work on robust planning for strategies to help their organizations avoid being a part of a second layoff as it could have long-term repercussions on the brand image. Freeze new hiring Conducting a layoff drive is not the only way to cut down employee expenses. Organizations have to deliberately think about their business finances. To balance the finances, talent managers should work on a freezing strategy rather than working on strategies to make layoffs less painful for employees and smoothen the transition for the company. Freezing new hiring in line with positioning employees strategically can help organizations perform well during the layoff wave. This provides more time to re-evaluate business investment areas in terms of human resources while cutting down a major part of the organization budget. Encourage flexibility to WFH To cut down business expenses, organizations can adopt an approach of bringing ease in the work culture. A significant cost is spent in leasing out and operating an office space. Encouraging work from home or anywhere can significantly bring down a huge expense, making it less stressful for the organization as well as its employees. Instead, organizations should invest in remote collaboration tools like strengthening cybersecurity infrastructure to protect data and have a smoother transition and work-from-home culture. Cutting down other employee benefits Another significant way of avoiding layoffs for cutting expenses is to cut down benefits across the board. Pay cuts do not impact employees but help businesses save hefty amounts to add financial strength. Similarly, reductions in employee bonuses and incentives prove to be a better option than making them lose their job amid the crisis. Many organizations have adopted a long-term work-from-home policy for employees willing to work from anywhere and can have a pay cut than lose their job. Keep in-house up skilling on priority Upskilling is a proven method of crossing the layoff wave successfully. Since the pandemic has brought disruptions in businesses, organizations across the world are moving towards automation, bringing the requirement of advanced skill sets. Amid the layoff wave, organizations can organize in-house up skilling programs for their employees to make them ready for future roles. This will not only help the organizations to capture profitable opportunities in the market but at the same will bring an upward curve in the employees career graph. Organizations that organize learning and up skilling sessions for employees at regular intervals, always succeed in building a strong workforce. Bottom-line Amid the second wave of layoffs, the majority of organizations ask their talent managers to invest their time in building strategies to lay off employees humanely than sending brutal emails. Instead, they should invest the HR team time in building strategies to avoid layoffs and work."
}