{
    "passage":"Our character. Without getting into the complexity of action, let us first understand how action is performed. Action is done in two ways one is with effort and the other without effort. Effortless action is true yoga. Achieved we all perform actions with effort. This is the beginning of action action is done with me consciousness. Action thus performed, with me consciousness, is not yoga because it involves effort. Yoga emphasises swift action without giving much credence to I thought. When we want to excel in one skill, we need to put in a lot of effort in the beginning. In time, it becomes effortless. This is called efficiency. Take teaching as an example. Teaching a particular subject requires effort in the beginning, such as preparing notes, rehearsing before stepping into a classroom, self evaluating, and so on. As we teach the same subject, assisted by our constant learning that enhances our knowledge, we gain efficiency in time. We need not take lecture notes to the classroom, we need not prepare seriously. We might as well walk into the classroom empty handed and deliver the goods. Or we may take along lecture notes but not look at them now and then while teaching as we did in the beginning. This way efficiency is achieved. Effortless action is nothing but achieving efficiency. When we gain this efficiency in whatever we do, we are in a state of yoga. Our bodies and minds get totally involved in whatever we do with no effort. That is, we do not feel tired or become a spent force. The whole creation is moving in this direction effortless action. The only difficulty is that we are not aware of it. Effortless action also means responding to a situation spontaneously, without thinking too much about it. Otherwise, it would bind us to karma, which is inescapable. Instead, we wait for the situation to unfold before us and when it does, we act like a cat on the wall that lies in wait for a rat to come out of its hole. Once the rat appears and is close enough, the cat jumps and catches it. This is true action. There is no effort involved. Climate change is a complex challenge facing mankind. It is much more than just an environmental concern. It has far reaching consequences for sustainable development and equity. To mitigate climate change, there is a global effort to reach net zero by mid century. This mitigation plan intends to reduce the emissions and concentrations of greenhouse gasses into the atmosphere. The impacts of climate change will be felt across a range of sectors and businesses. Business as usual will not cut it. Action to become more resilient to current and anticipated risks are ongoing with sectors transitioning into low carbon operations. These include the introduction of renewables as alternate energy systems, adopting climate smart agriculture, and decarbonising manufacturing among others. Such transitions not only take us towards a carbon neutral economy but also prevent."
}