{
    "passage":"His house to go to the temple for prayers or to Hari Parbat heights to pay usual obeisance to the deity. On the one hand, the night long tirade against KPs and lionising of Islamic warlords snatched whatever remnant of peace of mind they were left with. The question that caused them grave distress was how they could live in the Valley of Kashmir without the goodwill of the majority community. They have had centuries of excellent and brotherly relations. Overnight their Muslim brothers had become their worst enemies as they threw their masks which they wore for centuries. Suspicion loomed largely among Muslims and Hindus of the Valley of Kashmir. This single night of defiance and revolt paralysed the govt machinery, and not a single policeman was visible anywhere in the city the following day. From the next day, it was the rule of the mosque, the priest and the anti national forces. Loudspeakers fixed to mosque tops blurred uninterruptedly, cautioning the Hindus to leave the Valley. Nevertheless, the hate campaign carried forward through barbaric and inhuman means of violence struck fear among the entire KPs population. The eviction of KPs from the Valley in Kashmir was only the latest. Before this, many such displacements took place. Nevertheless, the largest exoduses fled their homeland for fear of being persecuted. This was a genocide. They went together with so much bloodshed, anguish, chaos and suffering. The injustice and callousness they faced were shocking. Beyond everything, they were not refugees from another country but were rendered homeless and stateless in their nation India. What was their fault In a state where our external and internal enemies wanted to break from India and turn into an Islamic republic. Hence the cry of Azadi freedom. Freedom from what From Hindu majority India. Sh Jagmohan, who was then Governor of the erstwhile state of J&K, sent enough warning signals, but no attention was paid by those sitting at the helm of affairs. The forgiving and lenient attitude was inherent in the politics of deception and duplicity of the state. In tiny minor matters, hypocrisy and unproductivity were interwoven. Most politicians were adapted in speaking dual voices, one for the state and the other for the nation. This politics created different illusions for different actors of the drama. They continued to operate without checks and balances. Some underlying forces command the life of a nation, and such forces comprise the concealed channels of its social and political setup. Religion is one of these channels, which is most potent and essential. Throughout the history of humanity, religion has remained a powerful tool, despite its merits and demerits. In Kashmir, the religious orders of Sufis and Rishis had inbuilt sources of love, harmony, compassion, holiness, etc. Still, unfortunately, these traditions were not rejuvenated, not refashioned to narrow down the differences between the two communities. This was undoubtedly a leadership failure since independence. Article 370 of the Indian Constitution was one of the most robust roots which fomented."
}