{
    "passage":"Additionally, they are making the software more compact. Like VHS became floppy disks that moved to CDs, then pen drives and now even that is on the internet thanks to OTT platforms, the same thing is happening to Saabs technology. Businesses are becoming compact. Due to Saabs, e commerce businesses have altogether stopped investing in creating any infrastructure for the businesses. They are more eager to learn about how they can efficiently manage their businesses online, reach more customers & benefit from every new Saabs software update. If a business is all about meeting customer demands and earning profits, modern day entrepreneurs know that they can do it by simply using technology and support software. Inarguably the rise in the e commerce model of business has contributed to the mass employment and adoption of Saabs tech. And so, if you are looking for investing in this profitable avenue, then it might be a good time for it as India is currently leading the race for being the startup hub in the world. This means more small scale businesses which are ready to invest in software that provide holistic business solutions. In India, the conversation about organ donation is gaining momentum but there is a long road ahead before we establish substantial ground. Organ donation in the country is regulated by law allowing both deceased as well as living donors to donate their organs. Then why are we lagging behind in organ transplants and unable to meet the rising needs of organ donation? The need for organ donation in India Organ donation is a pressing issue in India due to the huge gap in the demand and supply of organs. The main reasons for this disparity are mainly lack of awareness, myths, infrastructure as well as religious beliefs and superstitions. According to the World Health Organisation, only around 0.01 per cent of people in India have pledged to donate their organs after death. While data shows that there is a huge requirement of organ transplants that is not being fulfilled, leading to nearly half a million deaths every year. It is time to step up and understand organ donation in depth in order to bridge the gap in receiving organs for transplant. Detailed overview of organ donation for the uninitiated, organ donation is the donation of the organs in your body to persons who require a transplant that will give them another chance at life. While you can pledge to donate your organs while alive, organ donation can be done after you are declared legally dead or brain dead irreversible condition where the heart is still beating only due to life support provided. Donation of some organs and tissues can also be done while alive. Organ donation can be done by any person irrespective of age, gender, ethnicity or religion. One donation from the deceased donor can save close to eight or nine lives of people suffering from organ failures and terminal illnesses. Organ donation is of two types, you can."
}