{
    "passage":"The recent BJP triumph in the state elections has been attributed to the overwhelming political machine created by Prime Minister Narendra Modi. What struck me most, however, as I followed the campaign through UP, was something different a hunger mismatch between BJP top leaders such as Modi, Amit Shah, Yogi Adityanath and most of their rivals, particularly those who lead Congress. It is a mismatch of hard working and self made entrepreneurs versus fifth generation party scions, with their palace intrigues, philosophical musings, pet liberal causes and overseas vacations. Trustees of the Employee Provident Fund last week recommended an interest of 8.1 on the fund accumulations for 2021 22 the lowest interest rate since 1977 78, when a rate of 8 was notified. But a blind comparison of interest rates over time can be misleading as the financial instruments available to EPF have been expanded to include equities. Yet, shortcomings of India huge social security scheme remain unresolved. EPFO had 46.2 million contributing members at the end of FY 2020 21. Its legal mandate covers three separate schemes, of which EPF and Pension Scheme are the most important. However, these two schemes are intertwined as the PF deductions and an employer contribution are spread across them. Returns on EPF are linked to the investment performance but the Pension Scheme is hybrid there is a partial government guarantee built into it. Most accumulated funds are directed into debt instruments over Rest 14 lakh crore at the end of FY21. About 50 of this is invested in Go and state government debt. Interest rates have trended downwards over the last three years and returns on EPF have followed suit. In 2020 21, the yield on debt investments was just 6.8. So, how does EPFO declare returns over 8 Extra returns comes from investing up to 15 of the annual inflows into financial instruments linked to equities? The risk return profiles of EPF and Pension Scheme have changed over the last few years. However, there inadequate information on what happening to this retirement saving scheme, which is growing fast because of EPF mandatory nature and Go subsidies to formalise jobs. Publicly available data on EPFO investments is scanty. This heightens concerns on lowering returns when retail inflation is firming up, even though the broad logic of lowering the rate is right. EPFO needs to be more transparent about details of its investments. Separately, the Pension Scheme needs timely actuarial assessments as there is a sovereign guarantee involved. These are pretty urgent as the number of organised sector workers as well as pensioners is going to grow, and markets and the economy will face many uncertainties for a while. Improving maternal health is a multi sectorial endeavor encompassing better access to inputs ranging from education and nutrition to contraceptives and institutional delivery. So the welcome decrease in India maternal mortality ratio from 122 to 103 maternal deaths per lakh live births between 2015 17 and 2017 19, shown by SRS data, is actually the."
}