{
    "passage":"The Credit Guarantee Scheme for Start-ups CGSS. As a result, investment in EV start-ups skyrocketed, surging by 255 in 2021 to $444 million in 2022. With continued public and private investment, the growth of the EV market in India is poised to continue on an upward trajectory in the coming years. Nitti Analog released a draft policy in April 2022 on battery swapping for two- and three-wheelers as a means to reduce nearly 1 Giga tons of carbon dioxide emissions by 2030. Battery swapping involves exchanging discharged batteries for charged ones. However, many experts claim that battery swapping is a technical and market dead-end that will only disconnect the vehicle from the fuel, which in this case, is a battery. The concept of battery swapping was once deemed a practical solution to the limited driving range of electric vehicles EVs and the scarcity of public charging stations. However, in 2022, the idea is increasingly being viewed as a technical dead-end, unlikely to provide a sustainable solution. The current state of the EV market, with many models offering a range exceeding 100 miles, renders battery swapping redundant. Furthermore, the infrastructure required to facilitate such a system is expensive and logistically complex, rendering it unfeasible for widespread adoption. Consequently, many industry experts predict that continued support for battery swapping will only serve to drain green investors funds, without offering a viable solution. Another major challenge is the intricate issue of battery ownership, and the need for standardization across different vehicle models to optimize performance. This could stifle innovation in the EV industry, limiting opportunities for manufacturers to develop more efficient and cost-effective battery technology. Additionally, the implementation of a battery-swapping system would require a higher number of batteries per vehicle, leading to increased production costs and environmental concerns related to battery disposal. It also goes against the very essence of India Atmanirbhar Bharat mission as the two-wheeler industry relies heavily on Micro, Small, and Medium Enterprises which account for over 80 of auto component manufacturing. The transition to EVs must be carried out in tandem with global markets to ensure cost-effectiveness and avoid making the domestic two-wheeler market too expensive for customers. It is crucial to acknowledge that India holds the distinction of being the world largest two-wheeler manufacturer and exporter, owing to significant investments, a focus on Make in India, leading-edge technology, innovative products, and cost-effective production methods. Furthermore, empowering consumers with the freedom to choose the technology or solution they prefer is imperative for a sustainable and dynamic EV market. Imposing mandates on the use of specific technologies could prove to be short-sighted, given the rapidly evolving nature of the industry. Allowing auto manufacturers to determine their approach to battery-swapping implementation would enable the establishment of standardized battery specifications, ensuring interoperability across different vehicle models. However, this could pose a challenge in terms of providing a unique experience to consumers and distinguishing between the varied performance and features offered by different manufacturers. Therefore, an approach that prioritizes consumer choice will assist in promoting innovation and will drive the growth and success of the EV industry in the long run. Furthermore, there is a risk of creating a monopoly if battery-swapping is separated from the vehicle business. Even a lateral association between battery manufacturers and."
}