{
    "passage":"The answer books, as that was not a relief that was available under RTI Act. RTI Act only provided a right to access information, but not for any consequential reliefs. Feeling aggrieved by the direction to grant inspection, CBSE has filed this appeal by special leave. Before us the CBSE contended that the High Court erred in i directing CBSE to permit inspection of the evaluated answer books, as that would amount to requiring CBSE to disobey its Examination By law 61 4, which provided that no candidate shall claim or be entitled to reevaluation of answer books or disclosure inspection of answer books; ii holding that Bye law 61 4 was not binding upon the examinees, in view of the overriding effect of the provisions of the RTI Act, even though the validity of that bye law had not been challenged; iii not following the decisions of this court in Maharashtra State Board of Secondary Education vs. Parish B. Sheath and iv holding that the examinee had a right to inspect his answer book under section 3 of the RTI Act and the examining bodies like CBSE were not exempted from disclosure of information under contended that they were holding the information in this case, the evaluated answer books in a fiduciary relationship and therefore exempted under. The examinees and the Central Information Commission contended that the object of the RTI Act is to ensure maximum disclosure of information and minimum exemptions from disclosure; that an examining body does not hold the evaluated answer books, in any fiduciary relationship either with the student or the examiner; and that the information sought by any examinee by way of inspection of his answer books, will not fall under any of the exempted categories of information enumerated in section 8 of the RTI Act. It was submitted that an examining body being a public authority holding the information, that is, the evaluated answer books, and the inspection of answer books sought by the examinee being exercise of right to information as defined under the Act, the examinee as a citizen has the right to inspect the answer books and take certified copies thereof. It was also submitted that having regard to section 22 of the RTI Act, the provisions of the said Act will have effect notwithstanding anything inconsistent in any law and will prevail over any rule, regulation or bye law of the examining body barring or prohibiting inspection of answer books. On the contentions urged, the following questions arise for our consideration Whether an examinee right to information under the RTI Act includes a right to inspect his evaluated answer books in a public examination or taking certified copies thereof? Whether the decisions of this court in Maharashtra State Board of Secondary Education other cases referred to above, in any way affect or interfere with the right of an examinee seeking inspection of his answer books or seeking certified copies thereof? Whether an examining body holds the evaluated answer books."
}