{
    "passage":"With the widespread adoption of affordable mobile devices and low cost data access, online gaming became the go to recreational activity for several men and women across the country. Currently, India is the 5th largest online gaming market. As the industry continues to be buffeted by winds of change, women make up for half of the hyper casual gamers. Catering to the nuances of audience segments is as much a priority in online games as other media, for instance in understanding primary motivations. For women, the research uncovered that easy access, ease of use, convenience, and low investment in online games are the most common motivators behind gaming habits. It is worth noting that 77 of India women mobile gamers are committed gamers, playing at least once a day spending an average of 53 minutes per day. Popular e sports genres include adventure, first person shooters, multiplayer online battle arenas, survivalist horror, virtual sports and strategy. Today, we are also witnessing a substantial increase in the share of serious women gamers mostly home makers and college students who are looking to boost their income by playing real money skill based games. Change makers As more and more women get involved in the gaming ecosystem, they are forming a major part of decision makers and reshaping the gaming landscape for the better. Not just limited to gamers and streamers anymore, women are now at the forefront of developing women themed designs, graphics and lead characters, breaking gender stereotypes and establishing a leading presence in the industry. In the coming years, the Indian gaming ecosystem can take cues from South East Asia where women game developers are continuing to enhance existing games and create new formats with art styles and graphics that offer exclusive experiences to female gamers and also fight the gender stereotypes that continue to prevail in online games. Way forward The engagement of women in online gaming is poised to increase exponentially in the coming years with the increase of advancement, accessibility and affordability of gaming technology. It safe to say that a large part of the future growth will come from female mobile gamers who do not fit the gaming stereotype of young urban males. As we move towards improved age and gender parity among online gamers, it about time that the gaming industry becomes adequately structured to serve this growing consumer segment. There could not be a better time for women developers and gamers to start their careers in this emerging industry. E waste refers to the waste arising from end of life electronic appliances like computers laptops and mobiles phones. International Finance Corporation, the advisory arm of the World Bank, says that the management of e waste becomes complex because of the presence of toxic metals, which causes severe environmental as well as health concerns. India is facing challenges in managing the existing e waste dump. There is a continuous increase with technology changing every day and users adopting the same. According to Global E Waste."
}