{
    "passage":"Disclaimer: I come from and represent the typical Indian middle class. Views expressed here are my personal and may vary greatly from the experiences of others. The colors run riot on holi. They come in every form. Powder, liquid, splash, sprays. Usually they are hand delivered. Sometimes they are delivered packed in balloons. In extreme cases, a person is delivered to the pool full of colored water. Clothes bear the brunt of vagaries of the colors. Every year on Holi, I stand in front of my cupboard and ponder what to wear. There are two types of clothes in there. One set is of clothes that I wear regularly. By default, they get aggregated on the right side of the closet. Then there are clothes that I don wear. Slowly and slowly they move towards left side. I look at the right side and decide not to spoil the clothes that I wear in routine. Then I look at the left side, and decide not to spoil them too as I might wear them some day. Then I try to remember what I wore on the last holi. Trying to remember details of a day one year back is a futile exercise. I do have the memory of elephants, for the simple reason that I am not an elephant. They have big bodies and may be a corresponding large brain with more memory space. On the other hand, I have a small body and I am sure, a corresponding small brain with almost negligible memory space. It is equally difficult to find the pictures of last holi to confirm the dress worn on that day. Moreover, pictures of all the holi s look same. Even the graying of hair is masked by the colors. Sometimes one is so colorful , it is difficult to recognize oneself. Beer and vodka make the day perfect but act as memory cleaner. I remember, last year I took off my clothes and dutifully placed them near the washing machine. Intention was to get them cleaned and store them for usage next year. I am sure they got washed. But next year, I do remember what did I wear or where I stacked them for future use. So like every previous year, I take out my t shirt which I consider the oldest, and pair it off with old jeans. And then I go out to celebrate the festival. There is so much fun and enthusiasm, I forget everything about clothes. I no longer am worried about what I am wearing. Anyways, soon clothes are so covered with color, it is almost impossible to tell the original color or shape. Then I see all around, one final look for what all are wearing. There I see combination of every kind. The most sophisticated and elegant wear new white attire. Then there are mediocre like me, jeans and t shirts. On the other end are people who are out there just to enjoy, they are in."
}