{
    "passage":"Thrive under fluctuating scenarios. Women entrepreneurs today have amply demonstrated these abilities. Technical competence traditionally, women were perceived to be better suited for fields such as arts and academics due to their creative skills, compassion, and the ability to synchronize different mindsets towards common goals. Today, they are increasingly mastering the technologies of the day, and these behavioral strengths of compassion, understanding and analyzing human nature have been augmented by advanced tech. Usage of AI, data analytics, and other advanced tools is enabling them to solve operational challenges through their technical competence and dedication to this field. The world of business is increasingly getting digitized and the pandemic has further pushed us towards a digital first ecosystem. This is where women entrepreneurs with their penchant for new ideas, innovations, and finding solutions to existing or emerging problems, prove to be an ideal fit. Self belief and a constant here is a way approach to operations, is what is leading them to emerge as an equally strong force in the startup ecosystem. Undoubtedly, the future wave of business leadership is certainly going to be a gender neutral one with women playing a key role in it, both qualitatively and quantitively. Independent Directors IDs have massive responsibility to safeguard the interest of stakeholders of companies, more importantly the listed companies. The very purpose of inducting IDs is to provide professionally competent people with no direct connect with the company to ensure that they can contribute without any bias for sustained growth of the enterprise. The wisdom and domain knowledge expected from them may not be benefitting the listed entities defeating the very purpose of their induction unless IDs take keen interest in sharing their knowledge through board level deliberations. Criticality of their role in maintaining the standard of corporate governance CG of the company has been widely debated, discussed and their position in the board has been highlighted in public domain. Several prominent CG committees had highlighted their role and independence to intervene in the affairs of the organization. But the way corporate debacles and irregularities in implementing CG is repeatedly coming to fore, they are not doing, exactly what are they meant to do in many instances, of course, many are doing it. The continued passive attitude and indifference of IDs in the board is hurting the corporate sector in many ways. If their knowledge and experience is explored, the companies may see new emerging opportunities. The ongoing probe of colocation scam of NSE, the sudden resignation of all 3 IDs from PFS, the promoter company of PTS India. Irked by the developments in CG, SEBI has barred it from holding its board meet stalling the announcement of their Q3 results. Similarly, the resignation of Mr Ashneer Grover, the co founder and managing director of Barite from his position in the Unicorn finch company, the alleged role of his wife in steering some activities in her role are some of the latest additions to the long list of corporate sector failures."
}