{
    "passage":"And even the receiving society have a part to play. A Patna high court judge has been giving government officials a dressing down for appearing before him in workaday casual attire he believes does not conform to the court dress code. Going by the video clips circulating online, the officials are dressed in a regular shirt and slacks; the judge would have them in formal jacket with closed collar. On the matter of formal informal attire in India, there are two schools of thought one that believes, formal official occasions demand formal dressing, which is often heavy and over the top. The other line of thinking, to which I subscribe, is that we need to dump these foreign driven, colonial hangover dress codes, which are not consonant both with our weather and our culture and heritage. I vet essayed my 0.02 or char Anna on this before. It is summer in India, and lashing out at officials for wearing light clothes, which are not in any way disrespectful, seems over the top. Would the judge have had a meltdown if the officials had appeared in a cool white dhoti and karat It would seem so judging by his fury. For that matter, the dress code in our courts itself black robes black jackets for one needs to be trashed. Some years ago, I made the following observation when Nawaz Sharif, at that time Pakistan prime minister, landed in 40 degrees C 100 degrees F New Delhi heat wearing a heavy suit and a necktie. I think the bands can really learn from the Asian bays in dressing down a bit; at least dressing a little lightly. At one of the Asian gigs, they had everyone wearing the Javanese Kat shirts yes, even MMS. Our weather at this time of the year demands a cool white dhoti with full air conditioning and a cool white karat. I hope PM Modi takes the sartorial lead here. My recollection is Sri Lankan leaders dress way cooler. I remember meeting J R Jayewardene wearing a cool white dhoti. Another time, I appreciated Prime Minister Modi wearing a dhoti for a meeting with President Xi Japing in Tamil Nadu. As I noted several years ago in this post, formal does not have to be heavy. Expecting officials to wear jacket tie etc. when temperatures across North India are 40 degrees plus defies common sense. From the archives Choke the necktie; untied we should stand Now that the convocation gown has been stripped of its hallowed status by one of our most prominent public figures, perhaps it time to examine our mindless adoption of another relic of western dress code. It the necktie, that suffocating hangover from our colonial past. At least one has to suffer or enjoy, as some do academic regalia only once or twice in life, typically on graduation day. And there a certain joy in throwing the mortarboard which is what the square academic cap is called in the air, symbolizing freedom."
}