{
    "passage":"It faces an existential crisis. Despite its patchy structure with too many rates, complex compliance requirements and multiple mid-course changes, the implementation of the Goods and Services Tax (GST), overseen together by the Centre and the States, had begun to almost serve as an exemplar of co-operative federalism. All of those gains have quickly unravelled as the slowdown in the economy, exacerbated by the COVID-19 lockdowns, has thrown all revenue calculations to the wind. The Centre is obliged to pay to the States, for a period of five years, compensation for revenue shortfalls in return for their having ceded the power to levy the multiple taxes that were subsumed into the GST. Last week, Finance Minister Nirmala Sitharaman asserted, at what may have been the most tenuous GST Council meeting so far, that the Centre will not be able to meet the compensation shortfall. With GST collections sharply undershooting all targets this year, the Centre estimates compensation payable for the full year at 3-lakh crore. But just 65000 crore is expected in the cess kitty used to pay out the compensation. In July, the Centre paid out the last instalment of compensation for the last fiscal and is, so far, yet to pay anything for this year. States have now been given two options, both requiring them to borrow from the market. The Centre contends that only crore of the revenue shortfalls is from implementation of the GST, while 1.38 lakh crore is due to extraordinary circumstances posed by exacerbated by the lockdowns, has thrown all revenue calculations to the wind. The Centre is obliged to pay to the States, for a period of five years, compensation for revenue shortfalls in return for their having ceded the power to levy the multiplean Act of (the pandemic). States can either borrow crore, without having it added to their debt and with the principal and interest paid out from future cess collections, or they can borrow the entire 2.35 lakh crore shortfall, but will have to provide for interest payments themselves. The Finance Ministry has argued that higher borrowing by the Centre will push up interest rates and dent India 25697 fiscal parameters. At best, this is specious total government debt, including States 25697, is what rating agencies look at. Several States have rejected both options and Centre to rethink in view of their essential and urgent spending needs to curb the pandemic and spur growth. A staring match is in the offing. It is up to the Centre took."
}