{
    "passage":"A foot mark or a crack Little else about fast bowling is as intricately dependent on the nature of the pitch as a ball on a good length. Not the Yorker obviously, and not even the bouncer which requires more from the body than the turf. This zone was best exploited by the likes of Glenn McGrath, Vernon Philander, and Ryan Harris in the past. You can add Mohammed Shame to that list from those going around today. On Thursday, both Jason Holder and Kumar Roach showed early that there was something on this Old Trafford pitch in that area. Particularly running in from the Brian Statham end. Four of the five wickets the duo picked came from this end. Sprit Bum rap would later pick up his first wicket Braithwaite nicking behind, after changing over to the Statham end, and then one more next ball Fabian Allen LBW by one nipping in. It was from this end that Shame launched India attack and he did take long to find his spot. It was in the quintessential Shame zone, where his real threat comes through. His upright seam is most useful when there help off that length, breaking the ball in or out. The kiddy pace gets exaggerated with the batsman unsure how to line the ball up. The line when just outside off threatens edges, stumps, pads and more. In his first over, Shame had Gayle edging one inside and then beat him on the outside. Then, he had gone on to have Sunil Ambries playing off the inside half of his bat, hit him on the thigh and generally make him look all at sea. It was also from this end that Shia Hope creamed a boundary off that Shame length. Typically such a shot would have received a bouncer riposte. The bowler can then claim to have the morale upper ground. But at Old Trafford, Shame could afford to go one better. He proceeded to bowl fuller than the lengths that he was targeting. It resulted too in what could be arguably Holder did something similar with KL Rahul the ball of the day the seam upright, the ball pitching and breaking in sharply to go between bat and pad and onto the top of the stumps. Shame other wicket in his first spell of had come with him shifting the length other way around. The plan to Gayle, he revealed, was simple. The one thing that I thought was that if I don allow him to open his arms, then it will be good because at some stage, he will go for it. Job done. This was not a hat trick that would make the headlines, but it had given India exactly what they want from Shame, to strike in the power play, and allow the spinners some breathing space before they come into the game. That magic he produces from the length to get the ball to move off the seam, does not come easy."
}