{
    "passage":"Monitor Report 2020, India e waste production has risen almost 2.5 times in 6 years, and managing this waste is not easy. The e waste management rules in India, which was introduced first in 2011 and amended in 2016; make electronics producers responsible for managing their share of e waste. The concept is called Extended Producer Responsibility EPR. So, even if consumers decide to manage their e waste, there is a lack of formal channel. The e waste management rules specify not just the need to handle e waste in an environmental friendly way, but also its transportation, storage and recycling, from where the journey starts. Here is where a Producer Responsibility Organization PRO comes in. PROs can work with the producers to manage the rising e waste crisis in India. A PRO role is to collect the e waste on behalf of the producers and ensure safe recycling through authorized recyclers only. The rules amended in 2016 allow having a PRO on board for a smooth collection and recycling of e waste, as per the recycling share allocated to a particular producer. According to the Central Pollution Control Board CPCB, India has 51 registered PROs in the country. CPCB mandates the PROs to be registered with them, to be called as a legal and formal entity to work in the sector. Despite these registered PROs, much of the e waste has been collected through informal sources like rag pickers, which never reach the right channel for recycling. While producers have been directed to manage their share of e waste and are continuously working with the PROs, the need of the hour is to build a cost effective business model to channelize e waste from users for recycling using a legal and formal sector. This will encourage more private players to become PROs or authorized recyclers. For this, government and producers should work closely to establish a formal route that can help the country to manage this low visibility crisis, which can impact the environment and health extensively, if not addressed immediately. Ever since India gained independence, it has been on a progressive path of development. For the past several decades, India has been one of the fastest growing major economies in the world. However, India development has not been uniform. Some of the cities in the country like Delhi, Mumbai, and Bangalore have seen world class development with modern infrastructure, high living standards, medical facilities, educational institutions, and high per capita income. The situation, however, beyond the major cities has been totally different. Until recently, most tier 2 and tier 3 cities lacked basic infrastructure, facilities, and opportunities. This forced people from these towns to migrate to the bigger cities in search of jobs, education, medical facilities, and better living standards. The situation in the rural areas was even worse. However, things have rapidly been changing in past few years. The efforts of the government and the emergence of digital technologies have led to a rapid transformation of life."
}