{
    "passage":"Socio cultural world. While most local experiences would be common to students across the country, national content and context available in stories such as the Panchatantra, the Jataka, etc. can be used as learning resources for ideas, thoughts, ethics, and right conduct. It is for the stakeholders- the experts involved in curriculum development, educators, teachers, and school administrators- to design and develop a curriculum for early childhood care and education that naturally grows out of their local contexts. The responsibility is theirs to make the best possible use of the national recourses contained in our knowledge traditions; to develop structures for the the child-society interaction as the kernel of the learning process; to train the teacher to navigate the learning process of the child; and, by doing all this, offer opportunities for the child to grow the panchakosha of his/her personhood. Swadharma but let that be a discussion for another time. Even though new regulations are difficult to meet for everyone and especially for the most unorganized part of the value chain, several industry groups welcome these. Why? They understand that these regulations promote quality and credibility of the Indian Medical Device industry. So that the tiny may not get trampled by the regulatory burden, these groups also simultaneously seek long enough transition periods, ease of compliance and urge regulatory modifications from time to time. In doing so they express their solidarity with the small as well as ensure that non-timely compliance from the least equipped in the value chain doesn grind everything to a halt. Though we try to tell the truth well and temper our voice, at times it may unwittingly hit anotch higher than necessary. This is out of our concern for the industry. Similarly, the Bureaucracy may be occasionally rude or menacing. This may be off-putting and disconcerting to the ones at the receiving end but such behavioral transgressions are also understandable given the enormous pressure of performancethe officials are under and diverse interests they need to reconcile. The vital point is that thegovernment has taken equitable decisions, has been supportive of all and vindictive towards none, in theMedTech industry. Both the CDSCO and the DoP have done a stellar job in translating the Government vision.They have moved the needle consultatively, empathically and thoroughly. The government and the industry have to continue to work together. Even when we are hurt we must remember these are times of unprecedented change. And forget. Have short memories and play the long game for all sections of the industry, the patient and the nation. 10 friendliest destinations across the globe that you can plan to travel to in the near future. he only person who can save you is you Sheryl Crow Introduction Breast cancer BC is the biggest killer cancer in women in India and globally. It killed over 76,000 women in India in 2020. For every ten women with BC, four died. Many of these deaths were preventable simply by early detection. But detection often is late and."
}