{
    "passage":"The Congress crisis is more than an internal party matter. Of course, the ongoing issues such as tussle between Ashok Gehlot and Sachin Pilot in Rajasthan and the delicate position of Gandhi family, especially in the wake of Rahul Gandhi Bharat Jodo Yatra, are entirely Congress-centric phenomena. The party lethargic attitude and its organisational inability to establish itself as a challenger are certainly responsible for these contradictions. There is, however, a need to go beyond these political manoeuvrings. The Congress crisis reflects a few serious structural problems of Indian politics, which are deeply rooted in the institutional formation of many political parties. Two crucial aspects of the present crisis, empty professionalism and individual worship, in my view, must be given serious analytical attention in this regard. Parliament must follow up on Supreme Court dissection of bad laws and pass better laws. When both Houses passed the Medical Termination of Pregnancy Act last year, MPs rightly made no distinction between married and unmarried women and substituted the word husband in the earlier Act with partner. But the MTP Act rules seemed to miss the point. They had the effect of excluding unmarried women among the seven categories of women with a right to have an abortion for pregnancies between 20-24 weeks. SC fixed this oversight. But much more important, the court in effect called into question IPC marital rape exception. Marking a huge shift in judicial thought, SC ruled that the category of survivors of sexual assault or rape or incest eligible for abortion includes married women subjected to sexual assault by husbands. We would be remiss in not recognising that intimate partner violence is the reality and can take the form of rape, SC noted. Ignoring marital rape in the MTP Act essentially meant compelling a woman to give birth even if she a victim of rape an unconscionable legal position and one that now struck down. IPC marital rape exception is also before SC, and hopefully, after years of judicial prevarication and executive inaction and or unwillingness this provision will soon become history. But the point is Parliament could have changed the law. Both Houses should also see what SC has said about India divorce law. Divorces should have to travel beyond district-level family courts. But many divorce cases end up in SC because the court powers under Article 142 to render complete justice is the only recourse available for those facing a legal vacuum when the ground is irretrievable breakdown of marriage. On Wednesday, SC pointed out that Indian divorce laws compel couples to show each other faults. Many countries have moved towards no-fault divorces. The Marriage Laws Amendment Bill Rajya Sabha passed in 2013 recognised irretrievable breakdown. That bill needs more work, including working in provisions of no-fault divorce. Or take the 1954 Special Marriage Act, which needs serious amending. The 30-day public notice of intended marriage is an absurd provision that infringes privacy. Parliament must proactively modernise these laws. MPs across party lines should champion them."
}