{
    "passage":"And ethical firmness required of a Judge. A Judge, like Caesar s wife, must be above suspicion. The credibility of the judicial system is dependent upon the Judges who man it. For a democracy to thrive and the rule of law to survive, justice system and the judicial process have to be strong and every Judge must discharge his judicial functions with integrity, impartiality and intellectual honesty. 9. There can be no manner of doubt that a Judge must decide the case only on the basis of the facts on record and the law applicable to the case. If a Judge decides a case for any extraneous reasons then he is not performing his duty in accordance with law. 10. In our view the word gratification does not only mean monetary gratification. Gratification can be of various types. It can be gratification of money, gratification of power, gratification of lust etc., etc. ... Page and 13 emphasis supplied 21. We are also not oblivious to the fact that mere suspicion cannot constitute misconduct . Any probability of misconduct needs to be supported with oral or documentary material, even though the standard of proof would obviously not be at par with that in a criminal trial. While applying these yardsticks, the High Court is expected to consider the existence of differing standards and approaches amongst different judges. There are innumerable instances of judicial officers who are liberal in granting bail, awarding compensation under MACT or for acquired land, back wages to workmen or mandatory compensation in other cases of tortious liabilities. Such relief oriented judicial approaches cannot by themselves be grounds to cast aspersions on the honesty and integrity of an officer. 22. Furthermore, one cannot overlook the reality of ours being a country wherein countless complainants are readily available without hesitation to tarnish the image of the judiciary, often for mere pennies or even cheap momentary popularity. Sometimes a few disgruntled members of the Bar also join hands with them, and officers of the subordinate judiciary are usually the easiest target. It is, therefore, the duty of High Courts to extend their protective umbrella and ensure that upright and straightforward judicial officers are not subjected to unmerited onslaught. Page and 14 23. It is evident in the case in hand that the High Court itself was cognizant of this settled proposition of law. Learned senior counsel for the appellant also finds no fault with these principles, and instead only seeks for their application to the facts of the present case. 24. It is a matter of record that at the time when the High Court was seized of this matter, writ petitions against both of the appellant s land acquisition judgments had been dismissed by its coordinate benches. The High Court has, nevertheless, rightly observed that dismissal of writ petitions against the appellant s orders did not serve as vindication or confirmation of her orders. Indeed, as correctly noted by the High Court, the scope of judicial review under Article."
}