{
    "passage":"Cities in India the state governments have also undertaken various initiatives to attract it firms and provide a conducive ecosystem by establishing industrial clusters, sees and various skill development initiatives to stay ahead in the digitization process. Industry bodies such as nasscom, Ascham, tie have also created access to financial assistance, mentorship, incubation and network opportunities to support path breaking ideas from the hinterlands. According to an estimate by zinnia a leading management consultancy, about 976 monks have set up 1,257 global in house centers gigs in India, out of which 68 gigs are in tier ii locations. The relaxation in the department of telecommunications compliance guidelines allowing its firm to work from anywhere amid covid 19 will further provide a fillip to this trend. The upcoming large scale developments such as Delhi Mumbai industrial corridor dim, metro neo and metro lite, Haryana orbital rail corridor will bolster connectivity and put tier 2 and tier 3 cities such as sonata, Jaipur, Dehradun, etc. On the infrastructure map. On the technological front, the proposed rollout of 5g technology augurs well for the it its industry in tier 2 and tier 3 cities. A datacenter policy is also in the pipeline that will escalate the digital transformation process in India. Moreover, the work from home model amid the covid 19 pandemic has set off a trend of reverse migration. Leading multinational firms are embracing the idea of expansion in tier 2 and tier 3 cities due to multiple advantages of cost effectiveness, lower land and labor costs, availability of the talent pool, and low attrition rate of the workforce. Besides serving as a consumer market, the cities such as Jaipur, Indore, luck now have emerged as an education hub, thereby generating skilled human capital employed in various firms. As a result, firms are moving to tap talent in Indian hinterlands instead of workforce migrating to tier 1 cities for employment. It has led to the rise of the emergence of the hub and spoke and edge model wherein tier 1 cities serve as hubs while tier 2 and 3 towns form the spoke network, and the edge implies the work that can be done remotely. This model allows leading it firms to diversify their operations at comparatively lower cost in tier 2 and tier 3 cities while retaining their clientele in tier 1 cities. Another emerging trend is the gig economy, wherein firms are looking to diversify their workforce through contract employees who impart flexibility and agility to their operational models. Bolstered by these factors, tier 2 and tier 3 cities will emerge at the forefront of the digital revolution. This trend will have a multiplier effect in terms of employment generation, curbing migration to metropolitan cities, boosting the local economy, improving living standards, and bridging regional disparities in economic development. However, it will be critical for these cities to sustain the digitization wave. Focus on strengthening infrastructure, encouraging skill development among the youth, fostering an entrepreneurial ecosystem, and catalyzing innovation through."
}