{
    "passage":"To reduce output volatility in order to harness export opportunities and to raise agricultural income. It may be noted that China remained an insignificant partner in India food grains trade till 2019 Figure. China share in India exports of food grains cereals increased to over five percent in the beginning of 2022. It surpassed seven percent of total cereals exports in June 2022 with an export value of $104.75 million. India total cereal exports to all destinations amounted to $1,449 million in the same month, which accounts for 3.43 percent of total merchandise exports US $42,292 million. It may be noted that annual cereals exports from India was $10,104 million in the financial year 2020 21. Since 2021, China clearly appears as one of the rising export markets. China imports cereals from several other countries. In 2021, imports from USA was the highest followed by Ukraine. India for the first time appeared in the top ten source of cereals imports. Majority of cereals exports from India are headed towards Asian countries e.g. Bangladesh, Saudi Arabia, Iran, Nepal, Viet Nam, Iraq, UAE, China, among others. Cereals exports to developed markets such as the US, EU remain lower. Several restrictive measures were behind the lack of food exports from India to China in the past. International trade in agricultural produce has been subject to various barriers. China was found to provide domestic support for agricultural produces i.e. in the form of market price support to producers of wheat, India rice and Japonica rice in excess of WTO commitments. Further, China administered tariff rate quotas TRQs for wheat, rice, and corn. The TRQ administration operates on an annual basis. However, applicants must apply for TRQ allocations from 15 to 30 October of the year preceding that for which TRQ certificate will be issued by National Development and Reform Commission NDRC of China. Export of rice to China needs to adhere to certain phytosanitary requirements e.g. the product should be free from grain pests. In order to facilitate rice exports, Government of India 2015 issued standard operating procedure for export of rice to China. An amended version is approved for adoption in 2021. Exporters need to obtain PSC for each consignment prior to export to China through online PQIS system. The latest encounter killings in Uttar Pradesh on 13 April 2023 have raised a storm once again. The motives and modus operandi of the state law enforcement agencies is being questioned by the political opposition. Political rhetoric aside, any extra-judicial killing or fake encounters by any law enforcing agency have to be seen as undemocratic and unlawful. However, this does not imply that all encounters are unlawful or murders in cold blood. Discretion, restraint, warnings, and use of minimal force are the bedrocks on which any police force works before an encounter takes place. There is no case for any assumption that UP police have forsaken all these basics and trigger-happy policemen are running around killing people at will. Two days later, Mr Atiq Ahmed and his brother were killed by three gunmen while they were being taken to the hospital for a routine medical examination. Brandishing expensive and local firearms, the intruders approached the two accused brothers as part of the media teams that had gathered at the hospital. The UP police were once again under a cloud and rightly so. The incident raises three fundamental questions. First, was there any complicity or laxity on part of the police in the murder of the don and his brother? Second, who were the powers behind the whole incident as it was obvious that the three gunmen who were apprehended were merely."
}
    