{
    "passage":"With renewable energy like wind power and solar. The global automotive industry is on the brink of disruption. Four technology-driven trends such as shared mobility, electrification, connectivity, and autonomous driving are leading the automotive industry to this disruption. These movements will shift markets and revenue pools, and will change the mobility behavior and build new avenues for competition and cooperation. The Indian automotive industry has started to experience these outcomes and effects of the global disruption. Out of the four growing trends, Electrification is of importance and might notably impact auto component manufacturers and auto OEMs. India has big plans for the emerging EV and its technologies in the country. E-mobility has taken place in India. In the Indian context, from pollution and its impact any discourse around Electric Vehicles cannot be disjointed, dependence on oil imports, dire must have more renewable sources of energy. The automotive industry could see it as an opportunity and should not view it as a threat. The good news is that policymakers are trying to seriously consider it and the social circle across the nation is making Electric Vehicle a buzzword. After lack of specific pointers towards electrification, the EV Industry in India will might take some more years to evolve. This does not owe to the Indian Government goals, targets and their resultant steps but simply because the automobile industry believes that India will also follow the low-carbon footsteps that are being taken by global big car markets like US, China, and Japan. Whether it an electric car, tractor, or truck, traction motors are important for making wheels spin. That why many automakers such as Ford, BMW, General Motors and Volkswagen plan to gather motors in-house. For example, Ford is spending $150 million to renovate its Van Dyke transmission plant in Sterling Heights, USA, to mass-produce electric-motors. With its modular ultimo drive power train family general Motors is also taking a vertically integrated approach, which comprise of three interchangeable motors. Vehicle weight is a crucial determiner of drive range. A 10% reduction in weight can improve up to 8% economy of fuel. Unfortunately, electric drive trains and batteries are notably heavier than ICE power trains. To counteract the growing weight of electric power trains Into the vehicle body, manufacturers are incorporating advanced lightweight materials. Replacing standard materials with lightweight magnesium and carbon fiber or aluminum alloys which can reduce the weight of a chassis and a vehicle body by up to 50%. Vehicle manufacturers must include these materials intelligently and make sure that weight deductions do not compromise vehicle safety. Despite the many environmental and economic benefits of hybrid vehicles and EVs, with regard to the availability and affordability of material used in manufacturing these vehicles there were many challenges. Going by the current chemistry of lithium battery and no other changes in technology in power train manufacturing in the four-wheeler hatchback segment, the total ask for materials is estimated to increase from 0.005 million tons to nearly 1.6 million tons, as per."
}
    