{
    "passage":"That are perceived as funny usually involve another subject at whom the humour is targeted. A classic example of the same is kapil sharma show where some jokes are cracked on subjects like someone lips, looks and other flaws. Depending upon the circumstances, it can take form of sarcasm, satire, parody, teasing, disparagement, ridicule, mockery etc. Involving bitter remarks, jibes, taunts which are offensive to the butt of the jokes but generates humour for the target audience. In the last 60 70 years, television and other similar platforms gave impetus to the humour based on superiority theories. The television shows allowed content creators to identify their target audience and then accordingly choose butts of the jokes. To start with some chose politicians, some chose celebrities and some even chose race as butts of the jokes. With the advent of social media; now, the people have started picking far more different topics and subjects to find humour. People have chosen their spouses, in laws, aunts, caste, city and what not as butts of their jokes; but most of it is based on superiority theories of humour. Even memes and roasts would fall under these categories. Having seen the major theories behind humour to understand as to what creates humour, we now need to see different levels of humour found in the people. Perhaps one can understand humour more easily if the six levels in which sense of humour is displayed are explained. India is taking giant leaps toward digitization and is on the cusp of the fourth industrial revolution. The mckinsey global institute mgi digital adoption index estimates India to be the second fastest digitizing economy among 17 leading economies globally. A nasscom report titled future of technology services winning in this decade highlights that over 50 digital initiatives in diverse sectors such as finance and banking, healthcare, it it’s are fuelling India digital dream and contributing 8 to the economy. The covid 19 pandemic has accelerated digitization and proved to be an inflexion point for the technology sector. The groundwork for the development of India information technology industry was laid by the electronics commission that envisaged the foundation of regional computing centers to spur software and intellectual capital development in India. The establishment of the national task force on information technology and software development and new telecommunication policy provided the roadmap further to catalyze the it its sector growth. Nevertheless, the initial it wave was confined to metropolitan cities such as grogram, Bengaluru, Hyderabad, etc. These destinations provided several conducive factors for growth, including superior infrastructure and a skilled workforce, among others. With metropolitan cities already having reached a saturation point, tier 2 and 3 cities have emerged as new loci of growth in the recent past. These cities have witnessed a spate of infrastructural developments that have made them sought after destinations for it its investment. The digital India and startup India campaigns, the jam trinity and smart cities mission have accelerated the urban transformation of tier the and."
}
    