{
    "passage":"And mothers have started getting benefits from government free ration schemes and mid-day meals in schools. Banks waived off loans worth Rs 2500 crores so that Gautama Adani could do better in his life. In the above list, a lot of these products are free, however, it is for the people to decide which of them is a Revdi and which one is a necessity. Promises that cannot be fulfilled should not be promised. Once it is said, it has to be fulfilled, even if it comes at a cost of hurting the capitalist sentiment and narratives that back them. Whether those promises should be considered welfare oriented, depends solely on what is being promised. Like the 2014 elections that promised 24 hours electricity, women safety, rapid employment and so on, multiplying the hopes of over 100 crore people, the election promises or public meetings never experienced a political campaigner speaking on writing off the big loans. Thus, the actual Revdi becomes a clandestine deal in a panopticon with nearly three fourths of the population even being aware of the same. The need for delivering goods for free which can never be a permanent solution but empower the people itself reflects the current status of the Indian economy. Economic development of any country is a holistic term and cannot be imagined without economic equality, rise in per capita income, reduction of rural urban disparity, self sufficiency of the industries, ample employment opportunities and so on. Thus, the narrative that connects these welfare schemes as a hindrance to economic development is a mere myth and a means to hide the failures of different governments to fulfil the actual requirements of economic development. Lastly, imagine a factory worker getting Rs 200 as her daily wage. It corresponds to Rs 6,000 a month. Even while buying a reel of thread, the worker pays GST, without any concession, at an equal rate as her capitalist owner. Likewise, lakhs of workers from the managerial to the grassroots level constitute the force contributing to the total production of different goods in the country. Thus, before entering the debate regarding the recently quoted, Revdi culture, it needs to be highly understood, who eats this Revdi. After paying the salary and bearing all the cost of production, the amount that the capitalist earns post the sale of the goods is surplus. And in recent years, what the government seems to be interested in, is not the concession in its indirect tax regime, but the removal of wealth tax, granting of tax incentives and so on. Thus, on one hand, a class of people are getting concessions even on their surplus and the same is being treated as a requirement, whereas, on the other, providing a few public welfare schemes to those, whose monthly surplus savings itself is defined by the cost of GST levied products are being dragged to the brink of further poverty. This is the time Revdis are again returning as a common gift. However, a."
}
    