{
    "passage":"And an access to captive colonial markets with little or no consumer choice. Few commodities, if any, escaped the long arm of the British raw materials trade. Bollywood, stop the Shania! Cancel the sangeet, mehndi, roka, saat pheras and honeymoon songs in Switzerland. Yeh shaadi nahi ho sakti munda may be 21 but kudi is only 18. The gap between googol gaga and I do is being increased for girls. They can vote and drive the minute they turn 18, but not marry. Ring fingers must be kept bare for another three years. Marital age now same as drinking, no underage bride has to sip mock tails. The manic pixie dream girl can jabber all she wants, but she cannot walk into a registrar office and sign as Mrs. until 21st birthday. Holly Go lightly is just 19 when she meets her Paul in Breakfast at Tiffany. Geet appears to be in her late teens in Jab We Met and comes up effervescent against her sober travel companion. Eighteen is a rom com age, biddable and bubbly, just waiting for male directors and aged heroes to mentor them into womanhood. By 21, however, women have finished college and thought of a career. In the account of creation, in the Book of Genesis, in the Old Testament of the Bible, we read that God created light and dispelled the darkness and the chaos there was on earth. Then he created the lights in the sky, the sun, the moon and the stars. Light is a metaphor for goodness and righteousness. Darkness signifies evil and sin. Light represents life. Without light everything would die on this earth. Jesus is the light of the world. His birth, which is now celebrated as Christmas every year, is not the whole story. Our celebration can only be complete when we embrace what the baby went on to do, what he did in his life, why he did it and what it means to us. Jesus birth was in humble circumstances, in a manger. In his early boyhood, he was a refugee. He had a three year public ministry when he performed great miracles, healed many and nurtured his disciples. This culminated in his self sacrifice, when he moved from adulation by the crowds, to betrayal, torture and execution, a path he willingly accepted. Three days after his death and burial, he rose again. This was a triumph of light over darkness and death that holds out for us the promise of eternal life. We also hear in the Gospel of John in the New Testament which says, God is light, in him there is no darkness at all. Similarly, in the Gospel of Matthew, there is again a reference to the light, when describing the transfiguration of Jesus on Mount Tabor, before three of his disciples: There he was transfigured before them. His face shone like the sun and his clothes became as white as the light. When the light fails in our homes, even."
}
    