{
    "passage":"Punjab, which is the highest in the last four years. However, 4675 incidents of stubble burning were reported in Haryana in 2020, compared to 6551 in 1991. In 2020, the number of cases of stubble burning in Punjab increased by 46.5 percent. During the same time period, Haryana experienced a decline of 28.6%. The total availability of paddy straw in Punjab is estimated to be around 20 million tons per year, according to a report submitted to the Punjab government by Guru Amga Dev. Veterinary and Animal Sciences University GADVASU, Ludhiana. Based on an average rate of Rest. 200 per quintal, the total value of this straw are estimated to be around Rest. 400 cores. Almost all of it is destroyed by fire in fields and the paddy straw must be used wisely. One of the most effective methods is to encourage farmers to use newly developed farm machinery that can handle stubble in the field. Farmers appear to be unwilling to incur additional costs. Subsidies from the government are required to purchase these. The Indian Agricultural Research Institute, Pusan, has also developed a bio decomposer that can turn stubble into manure in the field within 15 to 20 days. The Delhi government has made extensive use of bio decomposers since 2020. On October 16, 2020, the Honorable Supreme Court expressed its concern about the negative impact of stubble burning and appointed a one man commission, led by retired Supreme Court judge Justice Looker, to monitor and prevent stubble burning in Punjab, Haryana, and Uttar Pradesh. However, the decision was postponed due to assurances from the Central Government. As promised the Central Government has established CAQM, a statutory mechanism to coordinate and oversee diverse efforts to improve air quality in Delhi, Punjab, Haryana, Rajasthan, and Uttar Pradesh, as well as a remedial action plan. CAQM should be able to provide a long term solution to this problem. US Federal Reserve chair Jerome Powell recently said that Americans should be prepared for the global supply chain to remain in crisis through 2022. Lean manufacturing processes and just in time delivery mean a factory closure in one Asian country can unleash a global crisis. Covid induced supply chain disruption was a wakeup call for policymakers, highlighting the total dependence on one country for vital products. However, de risking strategies will take a few years to implement. A political war is underway in Telangana between the TRS government and BJP, with CM K Chandrasekhar Rae recently staging a public dharma in Hyderabad. The proximate cause for it is a dispute between the state and GoI over the procurement policy for the rabi agricultural season. Details aside, the development is important because it encapsulates the political economy underpinning the latest trends in India gargantuan MSP driven cereal procurement exercise. The spotlight has been on protesting farmers at Delhi periphery, largely from Punjab, Haryana and UP. However, it is developments in other states that explain the challenge better. Telangana and MP are the states with."
}
    