{
    "passage":"Countering the narrative, MEA spokesperson Arindam Bagchi has said, we have seen reports on the issue. India is a robust and vibrant democracy. It does not require certification from others. The claim that others need to protect our Constitution, is presumptuous and preposterous. The track record of the event organisers, is as well known as the biases and political interests of the participants. Central Law Minister Karen Rijiju hit out at Hamid Ansari for his remarks over Hindu nationalism, saying, what the former vice president has said is wrong, and as a member of the minority community, I can proudly say that India is the safest nation. He wondered, Why some people who enjoy the best freedom and privilege in India, join the anti India propaganda, peddled by foreign based anti India forces What satisfaction do they acquire by defaming India Senior BJP leader and Union Minister Mukhtar Abbas Naqvi said that the Bharat bashing brigade is engaged in competition of lynching the country culture, commitment and Constitution. Speaking to reporters, Naqvi said, some people are becoming a part of the anti India conspiracy of Pakistan sponsored organisations. These organisations are conspiring to create confusion over India culture and inclusivity. He said that these people are becoming a partner in the Pakistan propaganda, to defame India. Naqvi said that the country feels that some people and organisations want to tarnish India culture, nationalism and its ethos of unity in diversity. The mindset of Modi bashing is now changed to Bharat bashing, he alleged. Najmul Hoda, an IPS Officer, in a write up in Times of India, referring to Ansari assertion that, India is facing a new imaginary thing these days, and that is Cultural Nationalism, rightly says, to say that Indian nationalism is not cultural, would be like, denying Indian Nationhood, and making it merely a geopolitical entity, just like the British did. He says further, today, India Cultural Nationalism is being denied, by separating it from the nation. Through this, the country is being shown, only in a political light, without a national or cultural basis. Epilogue People like the ex Vice President of India have a reason for denying cultural nationalism to India. The Muslim invaders of India had made their hypothetical racial superiority and religion as the basis for ruling India. It is a historical fact that they never tried to be a part of the mainstream Indian Culture with thousands of years of glorious history. People like Hamid Ansari are following in the footsteps of these invaders, in denigrating the glorious cultural history of India, which is a common heritage of people belonging to all religions, and not only Hindus. To regain their cultural roots, Muslims in India have to let go of their fear of losing their identity, and be a part of this mainstream culture, the privilege that has been denied to them by the likes of Hamid Ansari, who & the likes of him, are responsible for alienating the Muslim & Christian Communities."
}
    