{
    "passage":"Doing a task assigned to them? Third, what could be the motives for the killings? None of the sympathizing political leaders have had the gumption to be more circumspect and factual in speaking on these incidents. Asad and his aide were prime suspects for the murder of Mr Umesh Pal, an advocate. The killing took place in February 2023 and both suspects were on the run for months. Umesh was eliminated as he was a prime witness in the killing of BSP MLA Mr Raju Pal and his two security guards in 2005. He had defeated the don brother in the elections to the state assembly. Atiq Ahmed could not stomach the defeat as it was an affront to the power he wielded. A few weeks after his election, the newly elected MLA was kidnapped and murdered brutally. Mr Atiq Ahmed family, including his wife, sons and brother have over 160 criminal cases registered against them currently. As per media reports, the family boasts of over Rs 11,500 crores of real estate assets that have been accumulated over last four decades through extortion and other similar means. That is not all. Scores of criminal cases have been dropped against the don and his family for lack of witnesses over the years. As many as ten judges refused to hear cases against him. Both, the witnesses and the judges, were scared of the wrath of the mafia controlled and run by Mr Atiq Ahmed. The question that arises here is who created this monster in UP? Initially he entered politics as an independent candidate and used his muscle power to secure votes. He was then courted by Apna Dal and SP with the latter giving him unprecedented political patronage that lasted till 2017 and included a ticket to the Lok Sabha in 2004. During all these years, his mafia raj and criminal activities expanded with impunity and his writ ran large in the state. The opposition and leaders like Akhilesh Yadav of SP and Mr Owaisi of AIMIM have already assumed that Mr Asad Mohammad, son of gangster turned politician Atiq Ahmed, and his aide were killed in a fake encounter, the official police statement notwithstanding. As expected, the Samajwadi party and AIMIM have also linked it with religion and questioned the state authorities if the encounters were limited to Muslims only. A good question but it also comes with an underlying admission that majority, if not all, of such criminals are Muslims. If that be the case, then it becomes imperative that the community introspects and finds solutions to address the problem socially within the community. The state and central governments must augment such initiatives if and when they take shape. The state of Uttar Pradesh has been largely peaceful and devoid of criminal activities for last few years under the BJP led government. This calm is a result of the no non-sense approach of the state authorities and the near guaranteed retaliation against mafia, gangsters and others who believed that they were above the law of the land. Did such an approach result in excesses at times? Perhaps it did. But the moot point to understand here is that such criminals had thrived on committing excesses against common citizens with impunity for too long. Giving them a taste of their own medicine was not a bad ploy. More importantly it seemed to have worked for the state. Today, many politicians are shedding crocodile tears for Atiq Ahmed, his son, and his brother. They are questioning the state motives and alluding to its complicity in the killings. Their stance is born more out of political compulsions than any genuine sympathy for the deceased. The killings are being used as political tools by the opposition for two reasons. Firstly, to discredit the state government and secondly, to preserve."
}
    