{
    "passage":"Scope to further fuel their entrepreneurial spirit. Our aim at Amway is to create a robust ecosystem that provides an avenue for entrepreneurial aspirants to own and operate their own business based on interests and passions they follow by providing product solutions to their communities online and turning passions into prosperity. We believe as these passion preneurs continue to rise, the businesses partnering with them by lowering the barriers to entrepreneurship will grow in value. The advent of creators has given way to a whole new economy, one that is still at a nascent stage in India. It will be exciting to witness the next 500 million internet users carving out their niche using social media platforms. Welcome to the passion economy! Gig Economy moves up gear in the digital era If one follows the evolution of work and workforce, the gig economy has been one of the breakthrough trends in the past decade. As online marketplaces and platforms came to be, they paved the way for the gig economy, providing exciting opportunities to be your own business and set your own time. They might not have represented passions, but they lowered the barrier for many people, especially women, to enter the workforce with the benefit of flexibility. Further, many employed in the regular workforce, work as freelancers to supplement their income. Aided by the platforms and uncertainties in the job market, the trend is here to stay. It is evident from the recent reports that the gig economy has the potential to touch up to 90 million jobs in the next eight to 10 years in the non agriculture sector alone. As the pandemic struck, even gig workers were impacted. Over time, instead of trying to get back to business as usual, they have been looking for a new way forward. In the past year, especially, there has been a silent convergence of opportunity, social media, and technology, paving the way for new entrepreneurs who are making a living doing what they love. Utilizing their passions, people from across regions are earning a living from the comfort of their homes, using just their phones and the internet. From cooking their best nutritious recipes to giving make up tutorials, many are building communities around health, fitness, adventure, cooking and beauty to turn their passions into livelihoods. In the past year, we have seen a significant surge in people exploring the business opportunity with Amway. It is impeccable to see how all our gig entrepreneurs are building online communities based on their passion for fitness, healthy living, cooking etc. For generations Amway Direct Sellers have been owning the strength of offline and it is only a natural extension to see them passionately drive this online. Our Amway Direct Sellers are building online communities based on their passions, which was earlier cemented offline through face to face interactions. Today, Amway has been seeing a rise in the passionate gigsters joining the business and driving their potential and leading this evolution of entrepreneurship."
}
    