{
    "passage":"Society Indira Gandhi was a prescient ruler. In 1971, she recognized that the troubles in East Pakistan presented her with a golden opportunity to hive Pakistan into two. She dressed Indian soldiers in Mufti Tahini clothes, taking a lesson from 1948, when Pakistan dressed its own soldiers in clothes of Muslim raiders, and sent her forces into East Pakistan, creating Bangladesh. Voila, a two-winged Pakistan ceased to exist. Bangladesh lives without tension with India. Pakistan has become an even more inveterate enemy of India. From sponsoring the Khalistan movement to instigating mayhem in Kashmir to causing terror all across India, it just won stop. In 2005, JJ Singh took over as India army chief. Pakistan western front was hot with its fight against the Taliban. The Americans had counseled India to keep Pakistan eastern front calm. JJ Singh said that since Pakistan was preoccupied on its western front, there was no better time for India to invade Pakistan. The general had the right idea, but it was way before its time. There was no way the Americans would allow India to invade Pakistan and disrupt their campaign in Afghanistan. In 2005, their war in Afghanistan still seemed winnable, although they desperately needed Pakistan support. They would not tolerate any disruption of Pakistan. The situation now is very different. The Americans have fled Afghanistan. Their only remaining interest in the Afar region is that Pakistan nukes don fall into the wrong hands. Pakistan is virtually at war with the Taliban, whom it had itself created. Pakistan is bankrupt and does know how to get out of the bankruptcy hole. Its army chief, Aim Miner, keeps issuing warnings against India, knowing fully well that India does not pose any threat to Pakistan. There are two currents in Pakistani society. One is the phobia of India. The second is that the Taliban want to impose sharia law in the country, which cause has widespread support amongst the lower classes. If Pakistan attempts to crush the Taliban, that means that it would be trampling upon the aspirations of its own people. It is debatable if and how Pakistan will bring the Taliban to heel, whether through talks or through war. But it cannot bring the pro-Taliban sentiment that pervades large sections of its own society to heel. If the Taliban triumphs in Pakistan, it will set alarm bells in Washington. The Americans would want Pakistan nukes to be safeguarded from the Taliban. Alarm bells would also ring in New Delhi. The Taliban adhere to the Disband sect of Sunni Islam. Disband is based in India. Some of India restive Muslim population would be susceptible to overtures from the Taliban to demand sharia law in India. Today, Pakistan has hardly a friend in the world. If India gets into a scrap with China, Pakistan would be expected to jump in on the side of the Chinese. But the opposite is not true. China will not join Pakistan in a war against India. Pakistan hates India."
}
    