{
    "passage":"Men and women merely players this world is a Lila, God divine play, and each of us is assigned to play a role. The role is played under the benevolent supervision of the Divine Producer Director. A play has several characters, some good and some evil. Just as actors play their part on the stage, so too we live our lives the characters may be obnoxious, fighting among themselves, or staging an emotional portrayal of hate, love and grief. Once the curtain falls, they return to the green room, wipe the makeup off their faces, change into their everyday clothes and resume their ordinary lives. The villain and the hero who vowed to destroy each other, embrace and congratulate each other, wish all actors good night and depart for their homes, once the play is over. Similarly, we too have come here to play our role in several relationships. Once we leave this physical body and enter the life beyond, we return to our homeland, to our True Self. Then we realise that the hurt, sorrow, grief, hate and envy accumulated over a lifetime are nothing but needless, irrelevant waste. The negativity of the past must be burnt to ashes so that we might awaken to a new life every day. Noam Simian, recitation of the Name Divine rejuvenates the soul and lifts it out of despair and bondage. Man is then reborn and rejuvenated with renewed faith in God. Addressing the summit, Prime Minister Narendra Modi called for prioritising regional security and cooperation, saying developments in Europe had raised questions about the stability of the global order. While it is true that BIMSTEC should be elevated as a regional body, especially in light of issues with the Saarc framework, stability of the global order requires India to think carefully about its future foreign policy posture. The Ukraine crisis has seen India abstain during all UN votes, raising doubts about its ability to play a key leadership role. For, no one can justify the completely unprovoked aggression that Russia has wrought on Ukraine. And as a champion of territorial sovereignty, India should have condemned the Russian invasion. In choosing not to, India has sought to preserve its strategic interests with Russia. Which is fair enough if you are a middle power and comfortable with that categorisation. However, if on the other hand India aspires to global power status, it must adhere to principles. Remaining tight lipped while a large nuclear nation invades and destroys a smaller non nuclear one does qualify as leadership. Hence, India can shy away from taking a position on big ticket global issues. Even if India actions are guided by a desire to stay away from big power rivalry, it can compromise on principles. Otherwise, sooner or later it is bound to find itself in a bind. Already questions are being raised about how the other members of the Quad which India joined to ensure a free and open Indo Pacific will react in case China."
}
    