{
    "passage":"Length and breadth of the U.K., were cock a hoop yesterday, as one Tory MP put it who says that anymore? Indeed, this year Diwali delivered a very special gift. Our first brown Prime Minister; the historical significance of the moment was overwhelming for many. The inevitable Ram & Site memes were doing the rounds like a whirling Dervish, who says that anymore? and the queue of Indian parents outside Winchester College, looking to enroll their offspring, has grown exponentially overnight. Poor little Asian kids; becoming a doctor is no longer good enough. However, we would do well to remember that while Lord Ram returned to Ajodhya having soundly vanquished his foes, Rishi Sunk has reached his summit purely through attrition i.e. he hid under a table while all the other candidates either withered away or imploded of their own accord. Moreover, if there had been another nominee and the vote had gone to the membership, it quite doubtful that the largely white congregation would have voted for him. Let also not forget that it was Rishi and his Bruit pals that created the economic debacle that caused the leadership crisis in the first place. This is our Obama moment someone gushed at me over dinner last night. Oh Purees I responded. Let not get carried away and put Sunk in the same league as a seasoned international statesman like Obama. Sunk, who only been a serving MP for the last seven years, has little to no diplomatic credentials nor the gravitas to match. Skills that are critical at present given the heightened geopolitical tensions in Europe and the far east. Rishi is a chancer by comparison. Also, importantly, Obama won a general election and wears full length, big boy trousers unlike our leader. As for calling out the gaping chasms in his predecessor mini budget, a lobotomized apricot could see the problems with embarking on an unfunded programmer of huge tax cuts. No one was surprised that Liz Truss did have a Scooby Doo clue about public finances, so it hardly something to hang one hat on. Moreover, it was the Tory Party ill-conceived Bruit project, built on fables and lies, that precipitated the UK financial woes in the first place. Anyone who has figured out that leaving the largest free trading bloc in the world was only going to lead one way, having already knocked around 5% off our GDP by some estimates, needs to wake up. Bruit was always about creating enough dislocation to create excess gains for the elite few at the expense of the majority. Rishi Sunk was and is a hardcore champion of that Bruit agenda. As a result of the last few weeks of economic turmoil, caused almost completely by the battle for supremacy within the Tory Party three different PM in the last three months, Sunk will now have to embark on a programmer of tax hikes and severe public spending cuts. This on top of the burgeoning energy costs and climbing."
}
    