{
    "passage":"India is facing a severe water crisis with the water quality deteriorating rapidly. According to the Composite Water Management Index report published by Niti Aayog in June 2018, India ranks 120 amongst 122 countries on the Water Quality Index, with nearly 70% of water being contaminated. In this context, the Jal Jeevan Mission program has rightly emphasized the importance of safe water delivery to every household in the country. The program has done excellent work in setting up National Accreditation Board for Testing and Calibration Laboratories (NABL) and training 5 women to collect water quality data from habitations across the country. Till now, over 1 million data points have been collected, and this data is currently being used by the program administrators to help resolve water quality issues in the habitations. However, there is huge value that can be unlocked across the ecosystem actors, including communities, government departments, civil society actors, researchers, and policymakers, by making the data public to the ecosystem. The granular data at the village level may be available to the Jal Jeevan Mission officials, but making it public could help address an array of prerequisites for a variety of stakeholders. The data made accessible as information that the communities can engage and understand can empower the communities whose problems it is trying to solve. Government departments can use this data to give their immediate focus and response to the highly water quality affected areas and seek information on the right solutions to be implemented to address the water quality issue. Civil Society members can focus their efforts on interventions in the water quality affected areas instead of spending time and effort on collecting water quality data again. Funders (CSRs and philanthropic organizations) can direct their funds in highly water quality affected areas. Markets can create affordable household/community-level solutions for local contextualized issues. Researchers can look at the data, correlate with other openly available data, and provide recommendations to policymakers, implementers, and WQ practitioners. Therefore, it is important to unlock the value of this data by making it public to the ecosystem. The Water Quality Management Information System (WQ-MIS) has already collected rich data, including about 10 million data points of water quality across the country. However, this data is available only at aggregated levels and only at the level of the states in the public dashboard. External stakeholders do not get to view whether the FTK (Field test kits) tests and the samples tested in laboratories are pre or post monsoon, what the nature and extent of contamination is if the samples are found contaminated, and what remedial action is being taken. Given the large scale of data collection, there may be some challenges with respect to the quality of data. However, instead of finding faults with the data, the ecosystem should work constructively to improve its quality and find the right solutions. This will require generating trusted verifiable data, creating an environment where errors in data are taken as opportunities to improve and correct the."
}
    