{
    "passage":"Social led commerce ecosystem the social commerce ecosystem with deeper digital adoption, consumers today are more open towards shopping online, a trend further accelerated by the pandemic. However, even with over 570 million internet users, only 100 million transact online in India. While the data represents a huge opportunity for brands across sectors, it also begets the question what factors keep people from transacting online According to multiple reports, one of the biggest inhibitors to online shopping is the missing human touch point and consequently, the lack of trust. Social media today plays an intrinsic role in influencing people opinions, desires and even aspirations. Enter creators. Leveraging their online communities based on their passions, they enable consumers, more so beyond the metros, to discover and gain access to shared passions. Social commerce is a powerful format and requires the right business model to scale. Hence, brands and platforms must support and equip creators or passion preneurs with guidance and personalized digital tools helping them scale their online community while also building a sales pipeline. In India, Amway is up skilling its direct sellers through digital training programs along with innovative social and digital tools, helping them bolster their online engagement. The National Mental Health Survey of India in 2016 found that 1 in 20 people in India suffer from depression and productive age groups from 20 50 years of age are affected most! Economic burden of mental disorders has been huge with mental disorders affecting 792 million people worldwide by the year 2017 and rapidly growing through the pandemic. Mental Health has an impact on morbidity and functionality and directly affects quality of life and productivity. People with severe mental health conditions die prematurely as much as two decades early due to preventable physical conditions. Statistics suggest that depression tends to be more common among women than men. Depression and anxiety become more common as people get older. People with severe mental disorders are especially vulnerable during emergencies and need access to mental health care and other basic needs. Looking at the statistics can be alarming, but there is hope in the future as organizations, communities and governments are cognizant of the fact that this condition needs to be addressed. The National Mental Health Policy has envisioned a plan to promote mental health, prevent mental illness, enable recovery from mental illness, reduce stigma in seeking mental health solutions and de segregation. It has also become a priority to ensure socio economic inclusion of persons affected by mental illness by providing accessible, affordable and quality health. In recent years, there has been increasing acknowledgement of the important role mental health plays in achieving global development goals, as illustrated by the inclusion of mental health in the sustainable development goals. A 21st century approach to mental health could have a positive impact on millions of individuals and families who are presently unable to access the mental health care and support that they need and will deliver significant economic and social benefits to."
}
    